> Все 4-буквенные слова, в составе которых могут быть буквы Н, О, Т, К, И, записаны в алфавитном порядке и пронумерованы, начиная с 1.
> 
> Ниже приведено начало списка.
> 
> 1. ИИИИ
> 2. ИИИК
> 3. ИИИН
> 4. ИИИО
> 5. ИИИТ
> 6. ИИКИ
> …
> 
> Найдите 10-е слово, которое содержит ровно две буквы О?

#### Решение #1 (Python)
```python
# И К Н О Т
# 0 1 2 3 4

l = 'ИКНОТ'
r = range(len(l))

index = 0
for a in r:
    for b in r:
        for c in r:
            for d in r:
                if [a, b, c, d].count(3) == 2:
                    index += 1

                    if index == 10:
                        print( l[a], l[b], l[c], l[d] )
```
**Ответ:** ИООТ.
