> Олег составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Олег использует 4-буквенные слова, в которых есть только буквы А, Б, В, Г, Д и Е, причём буква Г появляется ровно 1 раз и только на первом или последнем месте. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Олег?

Источник: kpolyakov

#### Решение #1 (Python)
```python
count = 0

for x in range(6**4):
    s = ''
    n = x
    for i in range(4):
        s = 'АБВГДЕ'[n%6] + s
        n //= 6
    
    if s.count('Г') == 1:
        if s[0] == 'Г' or s[3] == 'Г':
            count += 1

print(count)
```
**Ответ:** 250.
