> Логическая функция F задаётся выражением: ((y ∧ z) ≡ (w → x)) ∧ (w → y)
> 
> Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
> 
> Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.
> .
> | ? | ? | ? | ? | F |
> |---|---|---|---|---|
> | 0 |   | 0 |   | 1 |
> |   |   | 0 | 0 | 1 |
> | 0 |   |   |   | 1 |

#### Решение #1 (Python)
```python
print('x y z w')
r = range(2)

for x in r:
    for y in r:
        for z in r:
            for w in r:
                if ((y and z) == (w <= x)) and (w <= y):
                    print(x, y, z, w)
```

Получим:
```
x y z w
0 1 0 1
0 1 1 0
1 1 1 0
```

**Ответ:** wyxz.
