> Определите, сколько существует различных значений переменной s, при вводе которых данная программа выведет число 8. Для Вашего удобства программа представлена на четырёх языках программирования.

```python
s = int(input())
s = s // 7
n = 1
while s < 255:
  s = s + n
  n = n + 1
print(n)
```

#### Решение #1 (Python)
```python
count = 0

for x in range(-10000, 1000000):
    s = x
    s = s // 7
    n = 1
    while s < 255:
        s = s + n
        n = n + 1
    
    if n == 8:
        count += 1

print(count)
```
**Ответ:** 49.
