> Леонид составляет коды из букв слова ЛЕОНИД. Код должен состоять из 6 букв, буква Л должна встречаться в нём ровно два раза, буква О – как минимум один раз. Сколько различных кодов может составить Леонид?

#### Решение #1 (Python)
```python
from itertools import *

# ЛЕОНИД
# 012345

a = product('ЛЕОНИД', repeat=6)
count = 0

for i in a:
    if i.count('Л') == 2 and i.count('О') >= 1:
        count += 1

print(count)
```
**Ответ:** 5535.
