> На числовой прямой даны два отрезка: P = [6; 45] и Q = [18; 52]. Укажите наименьшую возможную длину такого отрезка A, для которого формула
>
> ((x ∊ Q) ≡ (x ∊ P)) ∨ (¬(x ∊ A) → ((x ∊ P) ∧ ¬(x ∊ Q)))
> 
> тождественно истинна (т. е. принимает значение 1 при любом значении переменной х).

#### Решение #1 (Python)
```python
def f(x, a):
    return ((18 <= x <= 52) == (6 <= x <= 45)) or ((x not in a) <= ((6 <= x <= 45) and (not(18 <= x <= 52))))


A = []

for i in range(1, 10000):
    i /= 10
    if not f(i, A):
        A.append(i)

print(A)
```
Получим список чисел от ``45.1`` до ``52.0``. Получается, x принадлежит (45; 52].

52 - 45 = 7.

**Ответ:** 7.
