#### Условие:

> На числовой прямой даны два отрезка: P = [19; 84] и Q = [4; 51]. Укажите наименьшую возможную длину такого отрезка A, для которого формула
>
> (x ∈ Q) → (¬(x ∈ P) → ¬((x ∈ Q) ∧ ¬(x ∈ A)))
> 
> тождественно истинна (т. е. принимает значение 1 при любом значении переменной х).

#### Решение #1 (Python):
```python
def f(x):
    return (4 <= x <= 51) <= ((not (19 <= x <= 84)) <= (not ((4 <= x <= 51) and (not (x in A)))))


A = []
for i in range(1, 1000):
    i = i/10
    if not f(i):
        A.append(i)

print(A[-1] - A[0])  # 14.899999999999999 => 15
```

#### Ответ: 15
