### Задание 1
> Чему равен модуль разности двух самых больших простых чисел, оканчивающихся на 7 и лежащих на отрезке [4057606, 4221214]?

#### Решение #1 (Python)
```python
nums = []
r = list(range(4_057_606, 4_221_214 + 1))[::-1]

primecount = 0
for n in r:
    if primecount > 2: break
    flag = True
    for j in range(2, int(n**0.5)):
        if n % j == 0:
            flag = False
            break
    
    if (flag) and ( str(n)[-1]  == '7' ):
        nums.append(n)
        primecount += 1

print(nums[-1], nums[-2])
print( abs( nums[0] - nums[1] ) )
```
**Ответ:** 150.

### Задание 2
> Число *1248* перевели в системы счисления [4, 22] и полученные числа записали вместе без пробелов, удалив единицы. Какая цифра встречается чаще всего?

#### Решение #1 (Python)
```python
nums = [0] * 30

for base in range(4, 22 + 1):
    n = 1248
    s = []
    while n > 0:
        s.append(n % base)
        n //= base

    for i in s:
        nums[i] += 1

for j in range(len(nums)):
    print(j, nums[j])
```
**Ответ:** 3.

### Задание 3
> На отрезке [10441, 16357] найдите максимальный остаток деления от числа на сумму его цифр.

#### Решение #1 (Python)
```python
maxdel = 0

for n in range(10_441, 16_357 + 1):
    dels = set()
    for j in range(2, int(n**0.5)):
        if n % j == 0:
            dels.add(j)
            dels.add(n//j)
    
    if len(dels) == 0:
        continue
    
    maxd = max(dels)
    summa = sum([int(i) for i in str(maxd)])

    maxdel = max(maxdel, n % summa)

print(maxdel)
```
**Ответ:** 30.

### Задание 4
> Исполнитель знает три команды: 1) +1; 2) \*3; 3) +11
> 
> Сколько вариантов достижения 31 из 1, минуя 25 и 26, проходя через 15 и 16?

#### Решение #1 (Python)
```python
def f(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    if x in [25, 26]:
        return 0
    return f(x+1, y) + f(x*3, y) + f(x+11, y)

print( f(1, 15) * f(15, 16) * f(16, 31) )
```
**Ответ:** 75.

### Задание 5
> Сколько чисел на отрезке [2133, 11191] делятя на квадрат суммы своих цифр?

#### Решение #1 (Python)
```python
count = 0

for n in range(2133, 11191 + 1):
    summa = sum([int(i) for i in str(n)])
    if n % summa**2 == 0:
        count += 1

print(count)
```
**Ответ:** 76.

### Задание 6
> F(n) = 1 при n < 5 иначе F(n) = n+F(n-2)-F(n//4)
> 
> Чему равна максимальная сумма цифр значения F(n) на отрезке [17, 60]?

#### Решение #1 (Python)
```python
def f(n):
    if n < 5:
        return 1
    return n + f(n-2) - f(n//4)

maxsum = 0

for n in range(17, 60 + 1):
    summa = sum([int(i) for i in str(f(n))])
    maxsum = max(maxsum, summa)

print(maxsum)
```
**Ответ:** 20.

### Задание 7
> Укажите наименьшее *A*, при котором значение истинно при неотрицательных *x* и *y*
> 
> (4x + 5y >= 28) V (x+y <= A)

#### Решение #1 (Python)
```python
for a in range(-100, 100):
    flag = True

    for x in range(100):
        for y in range(100):
            if (4*x + 5*y >= 28) or (x + y <= a):
                pass
            else:
                flag = False
                break
    
    if flag:
        print(a)
        break
```
**Ответ:** 6.

### Задание 8
> При каком наименьшем пятизначном *K* программа ниже выведет на экран *1 2*?
```
K, O, T = int(input()), 0, 0
while K>0:
  O, T, K = O + 1 if K % 10 < 4 else O, T + 1 if K % 10 > 6 else T, K // 10
print(O, T)
```

#### Решение #1 (Python)
```python
for i in range(10_000, 100_000):
    K, O, T = i, 0, 0
    while K > 0:
        O = O + 1 if K % 10 < 4 else O
        T = T + 1 if K % 10 > 6 else T
        K = K // 10
    
    if O == 1 and T == 2:
        print(i)
        break
```
**Ответ:** 14477.

### Задание 9
> Для хранения изображения (растровое, без сжатия) 80x192 отведено 4141 байт. Какое максимальное количество цветов в изображении?

#### Решение #1
```
Дано:
KN = 80 * 192
I = 4141 байт = 4141 * 8 бит

M - ?

Решение:
M = 2^i
I = KN * i
i = I/KN
i = (4141 * 8) / (80 * 192) = 2.15 = 2 бита
M = 2^2 = 4
```
**Ответ:** 4.

### Задание 10
> 6-буквенные слова 1) АААААА; 2) АААААБ; 3) АААААВ; 4) ААААБА по порядку, но с пропуском слов, содержащих сочетания ББ. Какое слово стоит на 131 месте?

#### Решение #1 (Python)
```python
from itertools import *

a = list(product('АБВ', repeat=6))
b = [''.join(i) for i in a]
s = [i for i in b if i.count('ББ') == 0]

index = 0
for i in s:
    index += 1

    if index == 131:
        print(i)

# либо print(s[130])
```
**Ответ:** АВБАБВ.

### Задание 11
> Значение выражения 64^98 - 64^86 + 8^80 - 8^17 - 17 (^ означает степень) записали в системе счисления с оснвоанием 7. Какая цифра там чаще встречается?

#### Решение #1 (Python)
```python
nums = [0] * 7

a = 64**98 - 64**86 + 8**80 - 8**17 - 17
while a > 0:
    nums[a % 7] += 1
    a //= 7

# print max number
print( nums.index(max(nums)) )
```
**Ответ:** 3.

### Задание 12
> В электронной таблице 17 на 17 клеток лежат камушки по формуле ``4 + (3 + номер строки + 2*номер столбца) остаток от деления на 9``. Петя идёт по клеткам из 1-1 и может только вправо и вниз. Максимально поднимет?

#### Решение #1 (Excel)
[Скачать файл с решением](https://github.com/Thundiverter/infege2022/raw/main/repofiles/test03_12.xlsx)

**Ответ:** 297.

### Задание 13
> После записи в режиме 22050Гц 16битного стерео звука получили файл размером 182 мегабайт. Сколько примерно минут шла запись?

#### Решение #1
```
a = (182 * 1024 * 1024 * 8) / (22050 * 16 * 2)
print(a/60)
```
**Ответ:** 36.

### Задание 14
> Пентагон взломал смартфон Пети из 19 задачи и узнал, что пока Вани нет, тот даёт бесконечным камушкам имена, состоящие из букв П Е Т Я. Сколько имён длиной 5 и чтобы там Е встречалась не менее 2 раз(а) он смог составить?

#### Решение #1 (Python)
```python
from itertools import *

a = product('ПЕТЯ', repeat=5)
count = 0

for i in a:
    w = ''.join(i)

    if w.count('Е') >= 2:
        count += 1

print(count)
```
**Ответ:** 376.

### Задание 15
> Строка содержала более 143 символов "1". Получилось 11Ы11. Минимальная длина?
```
ПОКА (НАШЛО(111) или НАШЛО(ЫЫЫ)):
  ЕСЛИ НАШЛО (111) ТО ЗАМЕНИ(111,Ы) ИНАЧЕ ЗАМЕНИ(ЫЫЫ,1)
```

#### Решение #1 (Python)
```python
for i in range(143, 1000):
    s = '1' * i

    while ('111' in s) or ('ЫЫЫ' in s):
        if ('111' in s):
            s = s.replace('111', 'Ы', 1)
        else:
            s = s.replace('ЫЫЫ', '1', 1)
    
    if s == '11Ы11':
        print(i)
        break
```
**Ответ:** 143.
