#### Условие:

> Укажите наименьшее целое значение А, при котором выражение
> 
> (3x + 4y ≠ 48) ∨ ((A > x) ∧ (A > y))
> 
> истинно для любых целых неотрицательных значений x и y.

#### Решение #1 (Python):
```python
def f(a, x, y):
    return (3*x + 4*y != 48) or ((a > x) and (a > y))


mini = float('inf')
for a in range(200):
    ok = True
    for x in range(200):
        for y in range(200):
            if not f(a, x, y):
                ok = False
                break
    if ok:
        mini = min(mini, a)

print(mini)
```

**Ответ:** 17
