#### Условие:

> Для какого наибольшего целого неотрицательного числа А выражение
> 
> (x2 – 11x + 28 > 0) ∨ (y2 – 9y + 14 > 0) ∨ (x2 + y2 > A)
> 
> тождественно истинно, т.е. принимает значение 1 при любых целых положительных x и y?

#### Решение #1 (Python):
```python
def f(a, x, y):
    return (x**2 - 11*x + 28 > 0) or (y**2 - 9*y + 14 > 0) or (x**2 + y**2 > a)


maxi = float('-inf')
for a in range(200):
    ok = True
    for x in range(200):
        for y in range(200):
            if not f(a, x, y):
                ok = False
                break
    if ok:
        maxi = max(maxi, a)

print(maxi)
```

**Ответ:** 19
