#### Условие:

> Все 5-буквенные слова, составленные из букв Б, К, Ф, Ц, записаны в алфавитном порядке и пронумерованы. Вот начало списка:
> 
> 1. БББББ
> 2. ББББК
> 3. ББББФ
> 4. ББББЦ
> 5. БББКБ
> 
>    ……
> 
> Запишите слово, которое стоит на 486-м месте от начала списка.

#### Решение #1 (Python):
```python
from itertools import product
chars = 'БКФЦ'
idx = 0

for word in product(chars, repeat=5):
    idx += 1
    if idx == 486:
        print(''.join(word))
```

#### Ответ: `КЦФКК`
