#### Условие:

> Все 4-буквенные слова, составленные из букв П, Р, В, Д, А, записаны в алфавитном порядке и пронумерованы. Вот начало списка:
> 
> 1. АААА
> 2. АААВ
> 3. АААД
> 4. АААП
> 5. АААР
> 6. ААВА
> ...
> 
> Найдите номер первого слова в этом списке, которое не содержит гласных и одинаковых букв. 

#### Решение #1 (Python):
```python
import itertools

chars = 'АВДПР'
i = 0
for word in itertools.product(chars, repeat=4):
    i += 1
    if word.count('А') == 0 and word.count('В') < 2 and word.count('Д') < 2 and word.count('П') < 2 and word.count(
            'Р') < 2:
        print(i)
        break
```

#### Ответ: `195`
