#### Условие:

> Пусть M — сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то значение M считается равным нулю.
> 
> Напишите программу, которая перебирает целые числа, бо́льшие 700 000, в порядке возрастания и ищет среди них такие, для которых значение M оканчивается на 8. Выведите первые пять найденных чисел и соответствующие им значения M.
> 
> Формат вывода: для каждого из пяти таких найденных чисел в отдельной строке сначала выводится само число, затем — значение М.
> 
> Строки выводятся в порядке возрастания найденных чисел. 

#### Решение #1 (Python):
```python
count = 0

for i in range(700000, 1000000):
    if count == 5:
        break
    m = 0
    dels = []
    for c in range(2, i//2+1):
        if i % c == 0:
            dels.append(c)
    if dels:
        m = max(dels) + min(dels)
    if m > 0 and m % 10 == 8:
        count += 1
        print(i, m)
```

#### Ответ: 
```
700005 233338
700007 100008
700012 350008
700015 140008
700031 24168
```
