#### Условие:

> Пусть M(N) — сумма двух наибольших различных натуральных делителей натурального числа N, не считая самого числа. Если у числа N меньше двух таких делителей, то M(N) считается равным 0.
> 
> Найдите 5 наименьших натуральных чисел, превышающих 10 000 000, для которых 0 < M(N) < 10 000. В ответе запишите найденные значения M(N) в порядке возрастания соответствующих им чисел N.

#### Решение #1 (Python):
```python
count = 0

for i in range(10000001, 10000000000):
    m = 0
    countDels = 0
    
    if count == 5:
        break

    for c in range(i//2+1, 2, -1):
        if i % c == 0:
            countDels += 1
            m += c
            if m > 10000:
                break
            elif countDels == 2:
                count += 1
                print(m)
```

#### Ответ: 
```
6876
6374
6924
8024
8358
```
