> Исполнитель Вычислитель преобразует число, записанное на экране.
> У исполнителя есть три команды, которым присвоены номера:
> 1. Прибавить 2
> 2. Умножить на 2
> 3. Прибавить 3
> Сколько существует таких программ, которые преобразуют исходное **число 2 в число 22** и при этом траектория вычислений программы содержит **число 11**?

#### Решение #1 (Python)
```python
def f(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    if x < y:
        return f(x + 2, y) + f(x * 2, y) + f(x + 3, y)

print(f(2, 11) * f(11, 22))
```
**Ответ:** 100.
