> Исполнитель Вычислитель преобразует число, записанное на экране.
> У исполнителя есть три команды, которым присвоены номера:
> 1. Прибавить 2
> 2. Умножить на 2
> 3. Прибавить 3
> Сколько существует таких программ, которые преобразуют исходное **число 2 в число 22** и при этом траектория вычислений программы содержит **число 11**?

#### Решение #1 (Python)
```python
def f(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    if x < y:
        return f(x + 2, y) + f(x * 2, y) + f(x + 3, y)

print(f(2, 11) * f(11, 22))
```
**Ответ:** 100.

#### Решение #2 (Python)
```python
a = {}
for x in range(-100, 100):
    a[x] = 0

a[2] = 1

for x in range(3, 11 + 1):
    a[x] = a[x-2] + (a[x // 2] if (x % 2 == 0) else 0) + a[x-3]

for x in range(2, 10 + 1):
    a[x] = 0

for x in range(12, 22 + 1):
    a[x] = a[x-2] + (a[x // 2] if (x % 2 == 0) else 0) + a[x-3]

print(a[22])
```
**Ответ:** 100.
