#### Условие:

> Леся составляет слова, содержащие ровно 3 буквы М, из букв Ч, О, А, Н, И, М, Е. Слово может иметь длину от 4 до 6 букв. Сколько слов может составить Леся? 

#### Решение #1 (Python):
```python
from itertools import product
chars = 'ЧОАНИМЕ'
count = 0

for i in range(4, 7):
    for word in product(chars, repeat=i):
        if word.count('М') == 3:
            count += 1
print(count)
```

#### Ответ: `4704`
