#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [20789; 35672], числа, имеющие ровно 5 различных делителей. Выведите количество таких чисел и наименьшее их них.

#### Решение #1 (Python):
```python
arr = []

for n in range(20789, 35672+1):
    count = 2  # добавим единицу и само число в счётчик заранее
    for c in range(2, n//2+1):
        if count > 5:
            break
        if n % c == 0:
            count += 1
    if count == 5:
        arr.append(n)

print(len(arr), min(arr))
```

**Ответ:** 1 28561
