#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [126849; 126871], числа, имеющие ровно 4 различных делителя. Выведите для каждого найденного числа два наибольших делителя в порядке возрастания.


#### Решение #1 (Python):
```python
for i in range(126849, 126871+1):
    dels = []
    for c in range(1, i+1):
        if i % c == 0:
            dels.append(c)
    if len(dels) == 4:
        print(sorted(dels)[-2], sorted(dels)[-1])
```

#### Ответ: 
```
42283 126849
2699 126853
25373 126865
433 126869
```
