#### Условие:
> Текстовый файл состоит не более чем из 1200000 символов, которые являются прописными буквами латинского алфавита. Определите максимальное количество идущих подряд символов, среди которых нет символов G, W, P.

#### Решение #1 (Python)
```python
s = open('../files/1205.txt').readline()
s = s.replace('G', ' ').replace('W', ' ').replace('P', ' ')

print(len(max(s.split(), key=len)))  # 83
```

#### Решение #2 (Python)
```python
s = open('../files/1205.txt').readline()
m = c = ''
for i in range(len(s)):
    if s[i] not in 'GWP':
        c += s[i]
        m = max(m, c, key=len)
    else:
        c = ''

print(len(m))  # 83
```

**Ответ:** 83
