#### Условие:
> Текстовый файл состоит не более чем из 1200000 символов, которые являются прописными буквами латинского алфавита. Определите максимальное количество идущих подряд символов, среди которых нет подстроки XYZ.

#### Решение #1 (Python)
```python
s = open('../files/1273.txt').readline()
s = s.replace('XYZ', 'XY YZ')

print(len(max(s.split(), key=len)))  # 305
```

#### Решение #2 (Python)
```python
s = open('../files/1273.txt').readline()
m = c = s[0] + s[1]

for i in range(2, len(s)):
    if s[i-2] + s[i-1] + s[i] != 'XYZ':
        c += s[i]
        m = max(m, c, key=len)
    else:
        c = s[i-1] + s[i]

print(len(m))  # 305
```

**Ответ:** 83
