#### Условие
> Текстовый файл содержит только заглавные буквы латинского алфавита(ABC…Z). Определите максимальное количество идущих подряд символов, среди которых не более одной буквы A.

#### Решение (Python)
```python
s = open('files/2250.txt').readline()
s = s.split('A')
m = 0
for i in range(len(s)-1):
    sub = s[i] + 'A' + s[i+1]
    m = max(m, len(sub))
print(m)
```

**Ответ:** 337
