#### Условие:
> Текстовый файл состоит не более чем из 106 символов и содержит только заглавные латинские буквы и десятичные цифры. Определите максимальное количество идущих подряд символов, среди которых нет трёх одинаковых подряд идущих символов. 

#### Решение:
```python
s = open('24.txt').readline()
k = m = s[0]+s[1]

for i in range(2, len(s)):
    if not (s[i-2] == s[i-1] == s[i]):
        k += s[i]
        m = max(m, k, key=len)
    else:
        k = s[i-1]+s[i]

print(len(m))
```

**Ответ:** 1080
