#### Условие
> Текстовый файл содержит строку из заглавных латинских букв и точек, всего не более 10<sup>6</sup> символов. Определите максимальное количество идущих подряд символов, среди которых нет точек, но есть не менее 3-х букв A

#### Решение (Python)
```python
s = open('files/2576.txt').readline()
m = 0
for s1 in s.split('.'):
    if s1.count('A') >= 3:
        m = max(m, len(s1))
print(m)
```

**Ответ:** 284
