#### Условие:
> Текстовый файл содержит строку из заглавных латинских букв и точек, всего не более 10<sup>6</sup> символов. Определите максимальное количество идущих подряд символов, среди которых нет точек, а количество гласных (букв A, E, I, O, U, Y) не превышает 7.

#### Решение (Python)
```python
s = open('files/2576.txt').readline()
for i in 'AEIOUY':
    s = s.replace(i, '*')

m = 0
for s1 in s.split('.'):
    if s1.count('*') <= 7:
        m = max(m, len(s1))
    else:
        a = s1.split('*')
        for j in range(len(a)-8):
            sub = a[j]+'*'+a[j+1]+'*'+a[j+2]+'*'+a[j+3]+'*'+a[j+4]+'*'+a[j+5]+'*'+a[j+6]+'*'+a[j+7]
            m = max(m, len(sub))
print(m)
```

**Ответ:** 90
