#### Уловие:
> Текстовый файл состоит не более чем из 108 символов прописных латинских букв (A, B, .., Z). 
>
> Определите, какая буква встречается в текстовом файле максимальное количество раз. Если таких букв несколько, запишите их в ответе в алфавитном порядке. Ответ необходимо записать прописными (заглавными) буквами.

#### Решение:
```python
s = open('24 (3).txt').readline()
d = {x: s.count(x) for x in sorted(set(s))}

m = max(d.values())
c = [i for i in d if d[i] == m]
print(''.join(c))
```

**Ответ:** DEV
