#### Уловие:
> Текстовый файл содержит строку из заглавных латинских букв X, Y и Z, всего не более чем из 106 символов. Определите максимальное количество идущих подряд троек символов ZXY или ZYX.

#### Решение:
```python
s = open('24(2).txt').readline()
s = s.replace('ZXY', '$').replace('ZYX', '$')
for x in 'XYZ':
    s = s.replace(x, ' ')
print(len(max(s.split(), key=len)))
```

**Ответ:** 28
