#### Условие:
> Текстовый файл содержит строку из заглавных латинских букв X, Y и Z, всего не более чем из 10<sup>6</sup> символов. Определите максимальное количество идущих подряд троек символов X*Y или Z*Y, где * обозначает один любой символ.

#### Решение (Python)
```python
s = open('../files/3760.txt').readline()
for x in 'XYZ':
    s = s.replace(f'X{x}Y', '*').replace(f'Z{x}Y', '*').replace(x, ' ')
print(len(max(s.split(), key=len)))
```

**Ответ:** 20
