#### Условие:
> Текстовый файл содержит строку из заглавных латинских букв X, Y и Z, всего не более чем из 10<sup>6</sup> символов. Определите максимальное количество идущих подряд троек символов X*X или Y*Y, где * обозначает один любой символ.

#### Решение (Python)
```python
s = open('../files/3761.txt').readline()
m = k = 0
for st in range(10):
    for i in range(st, len(s)-2, 3):
        if (s[i] == 'X' and s[i+2] == 'X') or (s[i] == 'Y' and s[i+2] == 'Y'):
            k += 1
            m = max(m, k)
        else:
            k = 0
print(m)
```

**Ответ:** 16
