#### Условие:
> Текстовый файл состоит из символов A, B и C.
>
> Определите максимальное количество идущих подряд пар символов AB или CB в прилагаемом файле.
> 
> Иcкомая подпоследовательность должна состоять только из пар AB, или только из пар CB, или только из пар AB и CB в произвольном порядке следования этих пар.
> 
> Для выполнения этого задания следует написать программу

#### Решение #1 (Python)
```python
s = open('../files/4203.txt').readline()
s = s.replace('AB', '*').replace('CB', '*')
for x in 'ABC':
    s = s.replace(x, ' ')

print(len(max(s.split(), key=len)))
```

#### Решение #2 (Python)
```python
s = open('../files/4203.txt').readline()
k = m = 0
for st in range(3):
    for i in range(st, len(s)-1, 2):
        if s[i]+s[i+1] == 'AB' or s[i]+s[i+1] == 'CB':
            k += 1
            m = max(m, k)
        else:
            k = 0
print(m)
```

**Ответ:** 65
