#### Условие:

> Введём выражение M & K, обозначающее поразрядную конъюнкцию M и K (логическое «И» между соответствующими битами двоичной записи).
> Определите наибольшее натуральное число A, такое что выражение
> 
> (( (X & 13 ≠ 0) ∨ (X & A ≠ 0)) → (X & 13 ≠ 0)) ∨ ((X & A ≠ 0) ∧ (X & 39 = 0))
> 
> тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?

#### Решение #1 (Python):
```python
def f(a, x):
    return (((x & 13 != 0) or (x & a != 0)) <= (x & 13 != 0)) or ((x & a != 0) and (x & 39 == 0))


maxi = float('-inf')
for a in range(200):
    ok = True
    for x in range(200):
        if not f(a, x):
            ok = False
            break
    if ok:
        maxi = max(maxi, a)

print(maxi)
```

**Ответ:** 13
