#### Условие:

> Введём выражение M & K, обозначающее поразрядную конъюнкцию M и K (логическое «И» между соответствующими битами двоичной записи). Определите наименьшее натуральное число A, такое что выражение
> 
> (X & 41 = 0) → ((X & 119 ≠ 0) → (X & A ≠ 0))
> 
> тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?

#### Решение #1 (Python)
```python
def f(a, x):
    return (x & 41 == 0) <= ((x & 119 != 0) <= (x & a != 0))

mini = float('inf')
for a in range(200):
    if all(f(a, x) for x in range(200)):
        if mini > a:
            mini = a
print(mini)
```

**Ответ:** 86
