#### Условие:

> Введём выражение M & K, обозначающее поразрядную конъюнкцию M и K (логическое «И» между соответствующими битами двоичной записи). Определите наименьшее натуральное число A, такое что выражение
> 
> (X & 53 = 0) → ((X & 19 ≠ 0) → (X & A ≠ 0))
>
> тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?

#### Решение #1 (Python)
```python
arr = []

for a in range(500):
    ok = True
    for x in range(500):
        if not ((x & 53 == 0) <= ((x & 19 != 0) <= (x & a != 0))):
            ok = False
    if ok:
        arr.append(a)

print(min(arr))
```

#### Решение #2 (Python)
```python
def f(a, x):
    return (x & 53 == 0) <= ((x & 19 != 0) <= ((x & a) != 0))

mini = float('inf')

for a in range(500):
    if all(f(a, x) for x in range(500)):
        if mini > a:
            mini = a
print(mini)
```
**Ответ:** 2
