#### Условие:

> Введём выражение M & K, обозначающее поразрядную конъюнкцию M и K (логическое «И» между соответствующими битами двоичной записи). Определите наименьшее натуральное число A, такое что выражение
> 
> (X & 13 = 0) → ((X & 40 ≠ 0) → (X & A ≠ 0))
> 
> тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)? 

#### Решение #1 (Python):
```python
arr = []

for a in range(500):
    ok = True
    for x in range(500):
        if not ((x & 13 == 0) <= ((x & 40 != 0) <= (x & a != 0))):
            ok = False
            break
    if ok:
        arr.append(a)

print(min(arr))
```

#### Ответ: 32
