> Исполнитель Компакт-500 преобразует число на экране. У исполнителя есть три команды, которым присвоены номера:
> 
> 1. Прибавить 12
> 
> 2. Прибавить 19
> 
> 3. Умножить на 9
> 
> Сколько существует программ, для которых при исходном числе 1 результатом является число 500 и при этом траектория вычислений содержит все числа, кратные 100, не содержит числа, кратные 10 и не кратные 100?

Источник: kpolyakov

#### Решение #1 (Python)
```python
def f(x, y):
    if x > y: return 0
    if x == y: return 1
    if (x % 10 == 0) and (x % 100 != 0): return 0
    return f(x+12, y) + f(x+19, y) + f(x*9, y)

print(f(1, 100) * f(100, 200) * f(200, 300) * f(300, 400) * f(400, 500))
```
**Ответ:** 7776.
