> У исполнителя есть три команды, которым присвоены номера:
> 
> 1. Прибавить 1; 2. Прибавить 2; 3. Умножить на 2.
> 
> Сколько различных чисел на отрезке [34, 59] может быть получено из числа 1 с помощью программ, состоящих из 6 команд?

#### Решение #1 (Python)
```python
a = set()

for i in range(3**6):
    n = i
    s = ''
    while n > 0:
        s = '123'[n%3] + s
        n //= 3
    
    v = 1
    for j in s:
        if j == '1': v = v + 1
        if j == '2': v = v + 2
        if j == '3': v = v * 2
    
    if 34 <= v <= 59:
        a.add(v)

print(len(a))
```
**Ответ:** 11.
