#### Условие:

> Автомат обрабатывает десятичное натуральное число N < 256 по следующему алгоритму:
> 
> 1) Строится восьмибитная двоичная запись числа.
> 
> 2) Полученное в п.1 число записывается справа налево (переворачивается)
> 
> 3) Из первого числа вычитается второе, результат записывается в десятичной системе счисления.
> 
> Найдите максимальное возможное число, которое может являться результатом работы алгоритма.

#### Решение #1 (Python):
```python
maxi = float('-inf')

for n in range(1, 256):
    x1 = format(n, '08b')
    x2 = x1[::-1]
    maxi = max(maxi, int(x1, 2) - int(x2, 2))

print(maxi)
```

**Ответ:**  225
