#### Условие:

> Алгоритм получает на вход натуральное число N > 1 и строит по нему новое число R следующим образом:
> 
> 1) Строится двоичная запись числа N.
> 
> 2) Подсчитывается количество нулей и единиц в полученной записи. Если их количество одинаково, в конец записи добавляется её последняя цифра. В противном случае в конец записи добавляется цифра, которая встречается реже.
> 
> 3) Шаг 2 повторяется ещё два раза.
> 
> 4) Результат переводится в десятичную систему счисления.
> 
> При каком наибольшем исходном числе N < 80 в результате работы алгоритма получится чётное число, которое не делится на 4?

#### Решение #1 (Python):
```python
maxi = float('-inf')

for n in range(1, 80):
    r = bin(n)[2:]
    for i in range(3):
        if r.count('1') == r.count('0'):
            r += r[-1]
        elif r.count('1') > r.count('0'):
            r += '0'
        elif r.count('0') > r.count('1'):
            r += '1'
    r = int(r, 2)
    if r % 2 == 0 and r % 4 != 0:
        maxi = max(maxi, n)

print(maxi)
```

**Ответ:**  76
