#### Условие:

> Автомат обрабатывает десятичное натуральное число N по следующему алгоритму:
> 1) Строится двоичная запись числа N.
> 2) К этой записи справа дописывается 0, если число нечетное, и слева 1 в обратном случае.
> 3) Если единиц в двоичном числе получилось четное количество, справа дописывается 1, иначе 0.
> 
> Например, двоичная запись 1010 числа 10 будет преобразована в 110100.
> Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью числа – результата работы данного алгоритма.
> 
> Укажите минимальное число N, для которого результат работы алгоритма будет больше 228. В ответе это число запишите в десятичной системе счисления. 

#### Решение #1 (Python):
```python
arr = []
for n in range(1000):
    # 1
    bin_n = bin(n)[2:]
    # 2
    if n % 2 == 0:
        bin_n = '1' + bin_n
    elif n % 2 != 0:
        bin_n += '0'
    # 3
    if bin_n.count('1') % 2 == 0:
        bin_n += '1'
    elif bin_n.count('1') % 2 != 0:
        bin_n += '0'

    if int(bin_n, 2) > 228:
        arr.append(n)

print(min(arr))
```

#### Ответ: `50`
