> Алгоритм вычисления значения функции *F(n)*, где *n* - целое неотрицательное число, задан следующими соотношениями:
> 
> *F(0) = 0;*
> 
> *F(n) = F(n-1) + 1*, если *n* нечётно;
> 
> *F(n) = F(n/2)*, если *n > 0* и при этом *n* чётно.
> 
> Укажите количество таких значений *n < 1 000 000 000*, для которых *F(n) = 3*.

#### Решение #1 (Python)
<!--
```python
rec = {}

def F(n):
    global rec
    if n in rec:
        return rec[n]
    if n == 0:
        return 0
    if n % 2 != 0:
        return F(n-1) + 1
    if (n > 0) and (n % 2 == 0):
        return F(n/2)

count = 0
for x in range(1_000_000_000):
    fn = F(x)
    rec[x] = fn
    if fn == 3:
        count += 1
    
    if x % 1_000_000 == 0:
        print(x // 1000000, '/ 1 000')

print(count)
```
-->
