#### Условие:

> Текстовый файл 24-171.txt состоит не более чем из 106 символов и содержит только заглавные буквы латинского алфавита (ABC…Z). 
> Файл разбит на строки различной длины. 
> 
> Определите максимальную длину цепочки символов, состоящей из повторяющихся фрагментов XYZ. 
> 
> Цепочка должна начинаться с символа X и заканчиваться символом Z. Например, для строки SAZZXYZXYZXZQW длина цепочки равна 6: XYZ+XYZ. 

#### Решение #1 (Python):
```python
s = open('24-4.txt').read().replace('XYZ', '3')
l = 0
arr = []
for i in s:
    if i == '3':
        l += 3
    else:
        arr.append(l)
        l = 0
print(max(arr))
```

#### Ответ: `51`
