#### Условие:
> В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, сумма которых кратна 3 и не кратна 6, а произведение оканчивается на 8, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.

#### Решение (Python)
```python
f = [int(i) for i in open('../files/kompege/1993.txt')]
count = 0
mx_pair = 0

for i in range(len(f)-1):
    if abs(f[i] + f[i+1]) % 3 == 0 and abs(f[i] + f[i+1]) % 6 != 0 and abs(f[i] * f[i+1]) % 10 == 8:
        count += 1
        mx_pair = max(mx_pair, f[i]+f[i+1])

print(count, mx_pair)
```

**Ответ:** 140 17031
