#### Условие:
> В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, произведение которых положительно, а сумма кратна 7, затем минимальное из произведений элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.

#### Решение (Python)
```python
f = [int(i) for i in open('../files/kompege/1994.txt')]
count = 0
min_pair = float('inf')

for i in range(len(f)-1):
    if f[i] * f[i+1] > 0 and (f[i] + f[i+1]) % 7 == 0:
        count += 1
        min_pair = min(min_pair, f[i]*f[i+1])

print(count, min_pair)
```

**Ответ:** 359 115022
