#### Условие:
> В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые удовлетворяют следующим условиям:
> 
> а) Число в шестнадцатеричной записи оканчивается цифрой «B»;
> 
> б) Число делится на 7, но не делится на 6, 13, 19.
> 
> Найдите сумму таких чисел и их количество. Гарантируется, что искомая сумма не превосходит 107.

#### Решение (Python)
```python
a = [int(i) for i in open('../files/kompege/2017.txt')]
count = 0
summa = 0

for i in range(len(a)):
    if hex(a[i])[2:][-1] == 'b' and a[i] % 7 == 0 and a[i] % 6 != 0 and a[i] % 13 != 0 and a[i] % 19 != 0:
        count += 1
        summa += a[i]

print(summa, count)
```

**Ответ:** 74452 12
