#### Условие:

> Все 5-буквенные слова, составленные из букв А, З, Н, С, записаны в алфавитном порядке и пронумерованы. Вот начало списка:
> 
> 1. ААААА
> 2. ААААЗ
> 3. ААААН
> 4. ААААС
> 5. АААЗА
> ...
> 
> Какое количество слов находятся между словами САЗАН и ЗАНАС (включая эти слова)? 

#### Решение #1 (Python):
```python
from itertools import product
chars = 'АЗНС'
idx = 0

for word in product(chars, repeat=5):
    idx += 1
    strWord = ''.join(word)
    if strWord == 'САЗАН' or strWord == 'ЗАНАС':
        print(idx, ''.join(word))
print(787-292+1)
```

#### Ответ: `496`
