#### Условие:

> Все 6-буквенные слова, составленные из букв А, О, И, Э, У, записаны в алфавитном порядке и пронумерованы. Вот начало списка:
> 
> 1. АААААА
> 2. АААААИ
> 3. АААААО
> 4. АААААУ
> ...
> 
> Под каким номером стоит последнее слово, начинающееся и заканчивающееся буквой О? 

#### Решение #1 (Python):
```python
import itertools
chars = 'АИОУЭ'
idx = 0

for word in itertools.product(chars, repeat=6):
    idx += 1
    word = ''.join(word)
    if word[0] == word[-1] == 'О':
        print(idx, word)
```

#### Ответ: `9373`
