#### Условие:

> В файле содержится последовательность из 10 000 целых положительных чисел. 
> Каждое число не превышает 10 000. 
> 
> Определите и запишите в ответе сначала количество пар элементов последовательности, у которых сумма элементов кратна 10, затем максимальную из сумм элементов таких пар. 
> 
> В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

#### Решение #1 (Python):
```python
f = [int(i) for i in open('17-2.txt').readlines()]
count = 0
max_sum = 0

for x in range(10000):
    for y in range(x+1, 10000):
        if (f[x] + f[y]) % 10 == 0:
            count += 1
            max_sum = max(max_sum, f[x] + f[y])

print(count, max_sum)
```

#### Ответ: `4999742` `19990`
