#### Условие:

> В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает 10 000. 
> 
> Определите и запишите в ответе сначала количество пар элементов последовательности, у которых разность элементов кратна 45 и хотя бы один из элементов кратен 18, затем максимальную из разностей элементов таких пар. 
> 
> В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

#### Решение #1 (Python):
```python
f = [int(i) for i in open('17-3.txt').readlines()]
count = 0
max_diff = -10001

for x in range(10000):
    for y in range(x+1, 10000):
        p1 = f[x]
        p2 = f[y]
        if (p1 - p2) % 45 == 0 and ((p1 % 18 == 0) or (p2 % 18 == 0)):
            count += 1
            max_diff = max(max_diff, p1 - p2)

print(count, max_diff)
```

#### Ответ: `92471` `9945`
