#### Условие:

> Файл содержит последовательность неотрицательных целых чисел, не превышающих 10 000. 
> Назовём парой два идущих подряд элемента последовательности. 
> 
> Определите количество пар, в которых хотя бы один из двух элементов делится на 3, а их сумма делится на 5. 
> В ответе запишите два числа: сначала количество найденных пар, а затем – максимальную сумму элементов таких пар.

#### Решение #1 (Python):
```python
f = [int(i) for i in open('17-6.txt').readlines()]
count = 0
mxSum = 0

for i in range(len(f)-1):
    p1 = f[i]
    p2 = f[i+1]
    if (p1 + p2) % 5 == 0 and (p1 % 3 == 0 or p2 % 3 == 0):
        count += 1
        mxSum = max(mxSum, p1 + p2)

print(count, mxSum)
```

#### Ответ: `635` `19730`
