#### Условие:

> Файл содержит последовательность неотрицательных целых чисел, не превышающих 10 000. 
> Назовём парой два идущих подряд элемента последовательности. 
> 
> Определите количество пар чисел, произведение которых кратно 15, а их сумма делится на 7. 
> В ответе запишите два числа: сначала количество найденных пар, а затем — максимальную сумму элементов таких пар.

#### Решение #1 (Python):
```python
f = [int(i) for i in open('17-1.txt').readlines()]
count = 0
max_sum = 0

for i in range(len(f)-1):
    a = f[i]
    b = f[i+1]
    if (a * b) % 15 == 0 and (a + b) % 7 == 0:
        count += 1
        max_sum = max(max_sum, a + b)

print(count, max_sum)
```

#### Ответ: `170` `18662`
