#### Условие:

> Элементами множеств А, P и Q являются натуральные числа, причём P={2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и Q={5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение
> 
> ((x ∈ A) → (x ∈ P)) ∨ (¬(x ∈ Q) → ¬(x ∈ A))
> 
> истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наибольшее возможное количество элементов в множестве A.

#### Решение #1 (Python):
```python
def f(x):
    return ((x in A) <= (x in P)) or ((x not in Q) <= (x not in A))


P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
Q = {5, 10, 15, 20, 25, 30, 35, 40, 45, 50}
A = set(range(1, 1000))

for i in range(1, 1000):
    if not f(i):
        A.remove(i)

print(len(A))
```

#### Ответ: 18
