#### Условие:

> Элементами множества А являются натуральные числа. Известно, что выражение
> 
> ¬((x ∈ {2, 4, 9, 10, 15}) ≡ (x ∈ A)) → ((x ∈ {3, 8, 9, 10, 20}) ≡ (x ∈ A))
> 
> истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наименьшее возможное значение произведения элементов множества A.

#### Решение #1 (Python)
```python
p = {2, 4, 9, 10, 15}
q = {3, 8, 9, 10, 20}
arr = []

for a1 in range(1, 200):
    for a2 in range(1, 200):
        a = list(range(a1, a2+1))
        multiplyA = 1
        ok = True
        for x in range(200):
            if not ((not(((x in p) == (x in a)) )) <= ((x in q) == (x in a))):
                ok = False
                break
        if ok:
            for i in a:
                multiplyA *= i
            arr.append(multiplyA)
print(min(arr))
```


#### Решение #2 (Python)
```python
P = {2, 4, 9, 10, 15}
Q = {3, 8, 9, 10, 20}
arr = []
mn_sum = float('inf')


def f(a, x):
    return (not ((x in P) == (x in a))) <= ((x in Q) == (x in a))


for a1 in range(1, 200):
    for a2 in range(a1, 200):
        A = list(range(a1, a2+1))
        if all(f(A, x) for x in range(200)):
            arr.append(A)

for s in arr:
    m = 1
    for n in s:
        m *= n
    mn_sum = min(mn_sum, m)

print(mn_sum)
```

**Ответ:** 90
