#### Условие:

> Элементами множеств А, P, Q являются натуральные числа, причём P={2,4,6,8,10,12} и Q={4,8,12,116}. Известно, что выражение
> 
> (x ∈ P) → (((x ∈ Q) ∧ (x ∉ A)) → (x ∉ P))
> 
> истинно (т. е. принимает значение 1) при любом значении переменной х. Определите наименьшее возможное значение суммы элементов множества A.

#### Решение #1 (Python):
```python
def f(x):
    return (x in P) <= (((x in Q) and (x not in A)) <= (x not in P))


P = {2, 4, 6, 8, 10, 12}
Q = {4, 8, 12, 116}
A = set()

for i in range(1, 1000):
    if not f(i):
        A.add(i)

print(sum(A))
```

#### Ответ: 24
