#### Условие:

> Элементами множеств А, P, Q являются натуральные числа, причём P={1,3,7}, Q={1,2,4,5,6}. Известно, что выражение
> 
> ((x ∉ A) → (x ∉ P)) ∨ ((x ∉ Q) ∧ (x ∈ P))
> 
> истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наименьшее возможное количество элементов в множестве A.

#### Решение #1 (Python):
```python
P = {1, 3, 7}
Q = {1, 2, 4, 5, 6}
arr = []

for a1 in range(100):
    for a2 in range(100):
        ok = True
        for x in range(100):
            if not (((not (a1 <= x <= a2)) <= (x not in P)) or ((x not in Q) and (x in P))):
                ok = False
                break
        if ok:
            arr.append(a2-a1+1)

print(min(arr))
```

#### Ответ: 1
