#### Условие:

> Элементами множеств А, P, Q являются натуральные числа, причём P={1,2,3,4,5,6}, Q={3,5,15}. Известно, что выражение
> 
> (x ∉ A) → ((x ∉ P) ∧ (x ∈ Q)) ∨ (x ∉ Q)
> 
> истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наименьшее возможное количество элементов в множестве A.

#### Решение #1 (Python):
```python
P = {1, 2, 3, 4, 5, 6}
Q = {3, 5, 15}
arr = []

for a1 in range(100):
    for a2 in range(100):
        ok = True
        for x in range(100):
            if not ((not (a1 <= x <= a2)) <= ((x not in P) and (x in Q)) or (x not in Q)):
                ok = False
        if ok:
            arr.append(a2-a1)

print(min(arr))
```

#### Ответ: 2
