#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [4837177; 4837236], простые числа. 
> Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку. 

#### Решение #1 (Python):
```python
count = 0

for i in range(4837177, 4837236):
    isPrime = True
    for c in range(2, i//2+1):
        if i % c == 0:
            isPrime = False
    if isPrime:
        count += 1
        print(count, i)
```

#### Ответ: 
```
1 4837187
2 4837201
3 4837213
4 4837219
5 4837223
```
