> На вход алгоритма подаётся натуральное число *N*. Алгоритм строит по нему новое число *R* следующим образом.
> 
> 1. Строится двоичная запись числа *N*.
> 
> 2. К этой записи дописываются справа ещё несколько разрядов по следующему правилу:
> 
>     а) Если *N* чётное, то к нему справа приписывается в двоичном виде сумма цифр его двоичной записи;<br>
>     б) Если *N* нечётное, то к нему справа приписываются два нуля, а слева единица.
>
> Полученная таким образом запись (в неё как минимум на один разряд больше, чем в записи исходного числа *N*) является двоичной записью искомого числа *R*.

#### Решение #1 (Python)
```python
for n in range(1, 1000):
    # 1
    nbin = bin(n)[2:]

    # 2
    nsum = sum([int(i) for i in nbin])

    if n % 2 == 0:
        nbin += bin(nsum)[2:]
    else:
        nbin = '1' + nbin + '00'
    
    r = int('0b' + nbin, 2)

    if r > 215:
        print(n)
        break
```

**Ответ:** 23.
