> Определите количество семизначных чисел, записанных в семеричной системе счисления, учитывая, что числа не могут начинаться с цифр 3 и 5 и не должны содержать сочетания цифр 22 и 44 одновременно.

#### Решение #1 (Python)
*Автор: [Алексей Кабанов](https://www.youtube.com/watch?v=hzWJOHI-Jlw)*
```python
from itertools import *
k = 0
for x in product('0123456', repeat=7):
    s = ''.join(x)
    if s[0] not in '035' and (not('22' in s and '44' in s)):
        k += 1
print(k)
```
**Ответ:** 466456.
