> Обозначим остаток от деления натурального числа *a* на натуральное число *b* как *a* mod *b*.
> Алгоритм вычисления значения функции *F(n)*, где *n* - целое неотрицательное число, задан следующими соотношениями:
> 
> F(0) = 0;
> F(n) = F(n-1) + 1, если n > 0 и при этом n mod 3 = 2;
> F(n) = F((n - n mod 3)/3), если n > 0 и при этом n mod 3 < 2.
> 
> Укажите наименьшее возможное *n*, для которого F(*n*) = 6.

*Источник: Статград.*

#### Решение #1 (Python)
```python
def f(n):
    if n == 0:
        return 0
    if n > 0 and (n % 3) == 2:
        return f(n - 1) + 1
    if n > 0 and (n % 3) < 2:
        return f( (n - (n % 3)) / 3)

for x in range(1000):
    if f(x) == 6:
        print(x)
        break
```
**Ответ:** 728.
