#### Условие:

> На числовой прямой даны два отрезка: P=[10,30] и Q=[25,55]. Определите наибольшую возможную длину отрезка A, при котором формула
> 
> (x ∈ A) → ((x ∈ P) ∨ (x ∈ Q))
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х. 

#### Решение #1 (Python) - наиболее правильное:
```python
def f(x):
    return (x in A) <= ((10 <= x <= 30) or (25 <= x <= 55))


A = list([i / 10 for i in range(1, 1000)])
for i in range(1, 1000):
    i = i / 10
    if not f(i):
        A.remove(i)

print(A[-1] - A[0])
```

#### Решение #2 (Python):
```python
arr = []
for a1 in range(100):
    for a2 in range(100):
        ok = True
        for x in range(100):
            if not ((a1 <= x <= a2) <= ((10 <= x <= 30) or (25 <= x <= 55))):
                ok = False
                break
        if ok:
            arr.append(a2-a1)
print(max(arr))
```
#### Решение #3 (Python):
```python
arr = []
q = [i for i in range(10, 31)]
p = [i for i in range(25, 56)]

for a1 in range(100):
    for a2 in range(100):
        a = [i for i in range(a1, a2+1)]
        ok = True
        for x in range(100):
            if not ((x in a) <= ((x in p) or (x in q))):
                ok = False
                break
        if ok:
            arr.append(a2-a1)
print(max(arr))
```

#### Ответ: 45
