#### Условие:

> На числовой прямой даны два отрезка: P=[37,60] и Q=[40,77]. Укажите наименьшую возможную длину такого отрезка A, что формула
> 
> (x ∈ P) → (((x ∈ Q) ∧ (x ∉ A)) → (x ∉ P))
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х. 

#### Решение #1 (Python):
```python
arr = []
for a1 in range(200):
    for a2 in range(200):
        ok = True
        for x in range(200):
            if not((37 <= x <= 60) <= (((40 <= x <= 77) and not (a1 <= x <= a2)) <= (not(37 <= x <= 77)))):
                ok = False
                break
        if ok:
            arr.append(a2-a1)
print(min(arr))
```

#### Ответ: 20
