#### Условие:

> На числовой прямой даны два отрезка: P=[5,30] и Q=[14,23]. Укажите наибольшую возможную длину такого отрезка A, что формула
> 
> ((x ∈ P) ≡ (x ∈ Q)) → (x ∉ A)
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х. 

#### Решение #1 (Python):
```python
arr = []
for a1 in range(500):
    for a2 in range(500):
        ok = True
        for x in range(500):
            if not(((5 <= x <= 30) == (14 <= x <= 23)) <= (not (a1 <= x <= a2))):
                ok = False
                break
        if ok:
            arr.append(a2-a1+1)
print(max(arr))
```

#### Ответ: 9
