#### Условие:

> На числовой прямой даны два отрезка: P=[4,15] и Q=[12,20]. Укажите наименьшую возможную длину такого отрезка A, что формула
> 
> ((x ∈ P) ∧ (x ∈ Q)) → (x ∈ A)
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х. 

#### Решение #1 (Python):
```python
arr = []
for a1 in range(200):
    for a2 in range(200):
        ok = True
        for x in range(200):
            if not(((4 <= x <= 15) and (12 <= x <= 20)) <= (a1 <= x <= a2)):
                ok = False
                break
        if ok:
            arr.append(a2-a1)
print(min(arr))
```

#### Ответ: 3
