#### Условие:

> На числовой прямой даны два отрезка: P=[10,29] и Q=[13,18]. Укажите наибольшую возможную длину такого отрезка A, что формула
> 
> ((x ∈ A) → (x ∈ P)) ∨ (x ∈ Q)
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х. 

#### Решение #1 (Python):
```python
arr = []
for a1 in range(100):
    for a2 in range(100):
        ok = True
        for x in range(100):
            if not(((a1 <= x <= a2) <= (10 <= x <= 29)) or (13 <= x <= 18)):
                ok = False
                break
        if ok:
            arr.append(a2-a1)
print(max(arr))
```

#### Ответ: 19
