#### Условие:

> На числовой прямой даны два отрезка: P = [10, 25] и Q = [14, 40]. Найдите наименьшую возможную длину отрезка A, при котором формула
> 
> ¬(x ∈ A) ∧ ¬((x ∈ P) → ¬(x ∈ Q))
> 
> тождественно ложна, то есть принимает значение 0 при любых x.

#### Решение (Python):
```python
def f(x):
    return not (x in A) and not ((10 <= x <= 25) <= (not (14 <= x <= 40)))

A = []
for i in range(1, 1000):
    i = i / 10
    if f(i):
        A.append(i)

print(A[-1]-A[0])
```

#### Ответ: 11
