#### Условие:

> На числовой прямой даны три отрезка: P = [5, 108], Q = [28, 40] и R = [16, 72]. Какова наименьшая длина отрезка A, при котором формула
> 
> ((x ∈ P) → (x ∈ Q)) ∨ (¬(x ∈ A) → ¬(x ∈ R))
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х?

#### Решение #1 (Python):
```python
P = list(range(5, 109))
Q = list(range(28, 41))
R = list(range(16, 73))
mini = float('inf')

def f(a1, a2, x):
    return ((x in P) <= (x in Q)) or ((not (a1 <= x <= a2)) <= (not (x in R)))

for a1 in range(200):
    for a2 in range(a1, 200):
        if all(f(a1, a2, x) for x in range(200)):
            if mini > a2 - a1:
                mini = a2 - a1

print(mini)
```

#### Ответ: 56
