#### Условие:

> На числовой прямой даны три отрезка: P = [5, 110], Q = [15, 42] и R = [25, 70]. Какова наименьшая длина отрезка A, при котором формула
> 
> ((x ∈ P) → (x ∈ Q)) ∨ (¬(x ∈ A) → ¬(x ∈ R))
> 
> тождественно истинна, то есть принимает значение 1 при любом значении переменной х?

#### Решение #1 (Python):
```python
def f(x):
    return ((5 <= x <= 110) <= (15 <= x <= 42)) or ((x not in A) <= (not (25 <= x <= 70)))


A = []
for i in range(1, 1000):
    i = i / 10
    if not f(i):
        A.append(i)

print(A[-1] - A[0])
```

#### Ответ: 28
