#### Условие:

> На числовой прямой даны два отрезка: P = [20, 50] и Q = [30, 40]. Найдите наименьшую возможную длину отрезка A, при котором формула
>
> ¬(x ∈ A) → ¬((x ∈ P) ∨ (x ∈ Q))
> 
> тождественно истинна, то есть принимает значение 1 при любых x.

#### Решение #1 (Python):
```python
def f(x):
    return (x not in A) <= (not ((20 <= x <= 50) or (30 <= x <= 40)))


A = []

for i in range(1, 1000):
    i = i / 10
    if not f(i):
        A.append(i)

print(A[-1] - A[0])
```

#### Ответ: 30
