#### Условие:

> На числовой прямой даны два отрезка: P=[25, 98], Q=[1, 42]. Найдите наименьшую возможную длину отрезка A, при котором формула
> (x ∈ Q) → (¬(x ∈ P) ∧ (x ∈ Q) → (x ∈ A) )
> 
> тождественно истинна, то есть принимает значение 1 при любых x.

#### Решение #1 (Python):
```python
P = list(range(25, 99))
Q = list(range(1, 43))
mini = float('inf')

def f(a1, a2, x):
    return (x in Q) <= (((not (x in P)) and (x in Q)) <= (a1 <= x <= a2))

for a1 in range(200):
    for a2 in range(a1, 200):
        if all(f(a1, a2, x) for x in range(200)):
            if mini > a2 - a1 + 1:
                mini = a2 - a1 + 1

print(mini)
```

#### Ответ: 24
