#### Условие:
> На числовой прямой даны два отрезка: P=[1, 98], Q=[25, 42]. Найдите наименьшую возможную длину отрезка A, при котором формула
> 
> (x ∈ Q) → (¬(x ∈ P) ∧ (x ∈ Q) → (x ∈ A) )
> 
> тождественно истинна, то есть принимает значение 1 при любых x.

#### Решение #1 (Python):
```python
def f(a1, a2, x):
    return (24 <= x <= 42) <= (((not(1 <= x <= 98)) and (24 <= x <= 42)) <= (a1 <= x <= a2))
    
minlen = 10000000

for a1 in range(100):
    for a2 in range(a1, 100):
        if all(f(a1, a2, x) == 1 for x in range(100)):
            minlen = min(minlen, a2-a1)

print(max(minlen, 0))
```

#### Решение #2 (Python):
```python
def f(x):
    return (25 <= x <= 42) <= (((not (1 <= x <= 98)) and (25 <= x <= 42)) <= (x in A))


A = []

for i in range(1, 1000):
    i = i / 10
    if not f(i):
        A.append(i)

print(len(A))
```

**Ответ:** 0
