#### Условие:

> На числовой прямой даны два отрезка: P=[25, 42], Q=[1, 98]. Найдите наименьшую возможную длину отрезка A, при котором формула
> 
> (x ∈ Q) → (¬(x ∈ P) ∧ (x ∈ Q) → (x ∈ A) )
> 
> тождественно истинна, то есть принимает значение 1 при любых x.

#### Решение #1 (Python):
```python
p = list(range(25, 43))
q = list(range(1, 99))
arr = []
for a1 in range(200):
    for a2 in range(200):
        ok = True
        for x in range(200):
            if not ((x in q) <= (((not (x in p)) and (x in q)) <= (a1 <= x <= a2))):
                ok = False
                break
        if ok:
            arr.append(a2-a1)

print(min(arr))
```

#### Ответ: 97
