#### Условие:

> Определите наименьшее и наибольшее введённое значение переменной s, при котором программа выведет число 56. 
> В ответ запишите оба числа в порядке возрастания без пробелов и других разделителей.

#### Решение #1 (Python):
```python
arr = []
for i in range(-8, 1000):
    s = i
    n = 11
    while s > -9:
      s = s - 4
      n = n + 5
    if n == 56:
        arr.append(i)
print(min(arr), max(arr))
```

#### Ответ: `2427`
