#### Условие:

> Определите наименьшее и наибольшее введённое значение переменной s, при котором программа выведет число 67. 
> В ответ запишите оба числа в порядке убывания без пробелов и других разделителей.

#### Решение #1 (Python):
```python
arr = []
for i in range(11, 1000):
    s = i
    n = -5
    while s > 10:
      s = s - 8
      n = n + 3
    if n == 67:
        arr.append(i)
print(max(arr), min(arr))
```

#### Ответ: `202195`
