#### Условие:

> Определите наименьшее введённое значение переменной s, при котором программа выведет число 16.

#### Решение #1 (Python):
```python
arr = []

for i in range(20, -1000, -1):
    s = i
    n = 20
    while n > s:
      s = s + 1
      n = n - 1
    if n == 16:
        arr.append(i)

print(min(arr))

```

#### Ответ: `12`
