#### Условие:

> В магазине сотовой связи представлены смартфоны различной стоимости. Считается, что K самых дешёвых смартфонов относятся к бюджетному сегменту, а M самых дорогих – к премиум сегменту. По заданной информации о цене каждого из смартфонов определите цену самого дешёвого смартфона премиум сегмента, а также целую часть средней цены телефона из бюджетного сегмента.
>
> Входные и выходные данные. В первой строке входного файла 26-k5.txt находятся три числа, записанные через пробел: N – общее количество смартфонов (натуральное число, не превышающее 10 000), K – количество смартфонов в бюджетном сегменте, M – количество смартфонов в премиум сегменте. В следующих N строках находятся значения каждого из результатов (все числа натуральные, не превышающие 30000), каждое в отдельной строке.
> 
> Запишите в ответе два числа: сначала цену самого дешёвого смартфона премиум сегмента, а затем целую часть средней цены телефона из бюджетного сегмента.

#### Решение #1 (Excel):

[2642.xlsx](https://github.com/Thundiverter/infege2022/files/7951592/2642.xlsx)

#### Решение #2 (Python):
```python
f = open('files/2642.txt')
N, k, m = map(int, f.readline().split())
prices = sorted([int(f.readline()) for p in range(N)])

budget = int(sum(prices[:k]) / len(prices[:k]))
premium = min(prices[-m:])

print(premium, budget)
```

**Ответ:** 27700	7896
