#### Условие:

> На вход программе поступает набор чисел в диапазоне [10; 10000]. Необходимо узнать сколько чисел в массиве находятся в диапазоне между средним значением и медианой, включая совпадающие с этими показателями значения. Медианой называется такое значение, что ровно половина из оставшихся элементов больше медианы и, соответственно, вторая половина меньше медианы.
> 
> Входные данные представлены в файле 26-j2.txt следующим образом. В первой строке записано нечетное число N – количество чисел. В каждой из последующих N строк записано одно число из обрабатываемой последовательности. В качестве ответа вывести одно число – количество чисел, находящихся в диапазоне между средним значением и медианой.

#### Решение #1 (Python):
```python
from bisect import bisect_right, bisect_left

f = open('files/2644.txt')
n = int(f.readline())
arr = sorted([int(f.readline()) for i in range(n)])

median = arr[len(arr) // 2]
average = sum(arr) / len(arr)

average_idx = bisect_left(arr, average)
median_idx = bisect_right(arr, median)

print(median_idx - average_idx)
```

#### Ответ: 340
