#### Условие:
> Для перевозки партии грузов различной массы выделен грузовик, но его грузоподъёмность ограничена, поэтому перевезти сразу все грузы не удастся. 
> Грузы массой от 180 до 200 кг грузят в первую очередь, выбирая грузы по убыванию массы, начиная с самого тяжёлого. 
> На оставшееся после этого место стараются взять как можно большее количество грузов. 
> Если это можно сделать несколькими способами, выбирают тот способ, при котором самый большой из выбранных грузов имеет наибольшую массу. 
> Если и при этом условии возможно несколько вариантов, выбирается тот, при котором наибольшую массу имеет второй по величине груз, и т.д. 
> Известны количество грузов, масса каждого из них и грузоподъёмность грузовика.
> 
> **Входные данные.** Первая строка входного файла 26-39.txt записаны два числа: два целых числа: N – общее количество грузов и M – грузоподъёмность грузовика в кг. Каждая из следующих N строк содержит одно целое число – массу груза в кг. 
> 
> В ответе запишите два целых числа: сначала максимально возможное количество грузов, затем их общую массу.

#### Решение #1 (Excel)
[3153.xlsx](https://github.com/Thundiverter/infege2022/files/8891191/3153.xlsx)

#### Решение #2 (Python)
```python
f = open('files/3153.txt')
n, m = map(int, f.readline().split())
a = [int(i) for i in f]
a.sort(reverse=True)
b = []

for i in range(len(a)):
    if sum(b)+a[i] <= m and 180 < a[i] < 200:
        b.append(a[i])
        a[i] = 0

a = [i for i in a if i != 0]
a.sort()

while sum(b)+a[0] <= m:
    b.append(a.pop(0))

for i in range(len(b)):
    for j in range(len(a)):
        if a[j] > b[i] and sum(b)-b[i]+a[j] <= m:
            b[i], a[j] = a[j], b[i]

print(len(b), sum(b))
```

**Ответ:** 118 10000
