#### Условие:

> Для перевозки партии грузов различной массы выделен грузовик, но его грузоподъёмность ограничена, поэтому перевезти сразу все грузы не удастся. Грузы массой от 310 до 320 кг грузят в первую очередь, выбирая грузы по убыванию массы, начиная с самого тяжёлого. На оставшееся после этого место стараются взять как можно большее количество грузов. Если это можно сделать несколькими способами, выбирают тот способ, при котором самый большой из выбранных грузов имеет наибольшую массу. Если и при этом условии возможно несколько вариантов, выбирается тот, при котором наибольшую массу имеет второй по величине груз, и т.д. Известны количество грузов, масса каждого из них и грузоподъёмность грузовика. Необходимо определить количество и общую массу грузов, которые будут вывезены при погрузке по вышеописанным правилам.
> 
> Входные данные. Первая строка входного файла 26-39.txt записаны два числа: два целых числа: N – общее количество грузов и M – грузоподъёмность грузовика в кг. Каждая из следующих N строк содержит одно целое число – массу груза в кг. В ответе запишите два целых числа: сначала максимально возможное количество грузов, затем их общую массу.

#### Решение #1 (Excel)
[3154.xlsx](https://github.com/Thundiverter/infege2022/files/7963477/3154.xlsx)

#### Решение #2 (Python)
```python
f = open('files/3154.txt')
n, m = map(int, f.readline().split())
a = sorted([int(i) for i in f])
b = []

for i in range(n):
    if 310 <= a[i] <= 320:
        b.append(a[i])
        a[i] = 0
a = [int(i) for i in a if i != 0]

m -= sum(b)
c = []
while sum(c) + a[0] <= m:
    c.append(a.pop(0))

c.sort(reverse=True)
for i in range(len(c)):
    for j in range(len(a)):
        if a[j] > c[i] and sum(c) - c[i] + a[j] <= m:
            c[i] = a[j]

print(len(b) + len(c), sum(b) + sum(c))
```

**Ответ:** 113 9999
