#### Условие
> В текстовом файле записан набор натуральных чисел. Гарантируется, что все числа различны. Для каждой пары различных чисел из набора вычисляется значение K – количество чисел из набора, меньших среднего арифметического этой пары. Необходимо определить количество пар чисел с ненулевым значением K, кратным ста, а также наибольшее K среди этих пар.
> 
> Входные данные представлены в файле 26-47.txt следующим образом. Первая строка содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число, не превышающее 109.
> 
> В ответе запишите два целых числа: сначала количество пар, затем наибольшее значение K.

#### Решение #1 (Python)
```python
f = open('files/3763.txt')
n = int(f.readline())
a = [int(x) for x in f]
a.sort()
ans = []

for i in range(n):
    for j in range(i+1, n):
        average = (a[i] + a[j]) // 2
        k = i+1
        for h in range(i+1, n):
            if a[h] < average:
                k += 1
            else:
                break
        if k != 0 and k % 100 == 0:
            ans.append(k)

print(len(ans), max(ans))
```

#### Решение #2 (Python)
```python
from bisect import bisect_left

f = open('files/3763.txt')
n = int(f.readline())
a = sorted([int(i) for i in f])
ans = []

for i in range(n):
    for j in range(i+1, n):
        average = (a[i] + a[j]) // 2
        k = bisect_left(a, average)
        if k != 0 and k % 100 == 0:
            ans.append(k)

print(len(ans), max(ans))
```

**Ответ:** 4885 900
