#### Условие:

> В текстовом файле записан набор натуральных чисел. Гарантируется, что все числа различны. Рассматриваются пары чисел с чётной суммой, такие что половина элементов последовательности больше, чем среднее арифметическое элементов пары. Необходимо определить, сколько в наборе таких пар, и наибольшее из средних арифметических таких пар.
> 
> Входные данные представлены в файле 26-49.txt следующим образом. Первая строка содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число, не превышающее 109.
> 
> В ответе запишите два целых числа: сначала количество пар, затем наибольшее среднее арифметическое.

#### Решение #1 (Python)
```python
f = open('files/3765.txt')
n = int(f.readline())
a = [int(i) for i in f]
a.sort()
ans = []
half = n // 2

for i in range(n):
    for j in range(i+1, n):
        if (a[i] + a[j]) % 2 == 0:
            average = (a[i] + a[j]) // 2
            if a[half] > average:
                ans.append(average)

print(len(ans), max(ans))
```

**Ответ:** 3183529 56263918
