#### Условие:

> В текстовом файле записан набор натуральных чисел. Гарантируется, что все числа различны. Необходимо определить, сколько в наборе таких пар чётных чисел, что их среднее арифметическое тоже присутствует в файле, и чему равно наименьшее из средних арифметических таких пар.
> 
> Входные данные представлены в файле 26-53.txt следующим образом. Первая строка содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число, не превышающее 109.
> 
> В ответе запишите два целых числа: сначала количество пар, затем наименьшее среднее арифметическое.

#### Решение #1 (Python)
```python
f = open('files/3770.txt')
n = int(f.readline())
a = [int(i) for i in f]
b = set(a)
ans = []

for i in range(n):
    for j in range(i+1, n):
        if a[i] % 2 == 0 and a[j] % 2 == 0:
            average = (a[i] + a[j]) // 2
            if average in b:
                ans.append(average)

print(len(ans), min(ans))
```

**Ответ:** 15 133397333
