#### Условие:
> Для перевозки партии грузов различной массы выкупают место у компании, которая организует перевозку на грузовых судах. Судно не может принять на борт больше S тонн груза. Известно, что отдельный груз нельзя разделить для перевозки, то есть один груз должен доставляться одним рейсом на одном грузовом судне. В первую очередь перевозятся грузы как можно большей массы. За какое минимальное количество рейсов можно перевезти все грузы?
> 
> Входные данные представлены в файле 26-55.txt следующим образом. В первой строке входного файла записаны два целых числа: N – общее количество грузов и S – грузоподъёмность судна в тоннах. Каждая из следующих N строк содержит одно целое число < S – массу груза в тоннах.
> 
> В ответе запишите два числа – минимальное количество рейсов и суммарную массу грузов, которые будут перевезены последним рейсом.

#### Решение (Python)
```python
f = open('files/4102.txt')
n, s = map(int, f.readline().split())
a = [int(i) for i in f]
a.sort(reverse=True)
b = []
k, ls = 0, 0

while len(a) > 0:
    for i in range(len(a)):
        if sum(b)+a[i] <= s:
            b += [a[i]]
            a[i] = 0
    else:
        a = [i for i in a if i != 0]
        k += 1
        ls = sum(b)
        b = []
print(k, ls)
```

**Ответ:** 423 501
