#### Условие:

> Администратор написал скрипт для раскладки N архивов на K дисков, каждый объемом V. Алгоритм скрипта обрабатывает файлы в порядке убывания их размера. Если файл помещается на диск, то следующий по размеру файл стараются поместить на следующий диск. Если не помещается, то на следующий, и так по кругу. Если файл не поместился ни на один диск, то он откладывается в локальную папку. Укажите в ответе два числа: объем всех отложенных файлов и их количество.
> 
> **Входные данные** представлены в файле 26-56.txt следующим образом. В первой строке входного файла записаны значения V (объём диска), K (количество дисков) и N (количество архивов). Каждая из следующих N строк содержит одно целое число – размер очередного архива.
> 
> В ответе запишите два числа – объем всех отложенных файлов и их количество.

#### Решение #1 (Python)
```python
f = open('files/4132.txt')
v, K, n = map(int, f.readline().split())
a = [int(i) for i in f]
a.sort(reverse=True)

b = [0]*K
local = []

k = 0
for i in range(n):
    for j in range(k, k+K):
        if b[j%K] + a[i] <= v:
            b[j%K] += a[i]
            k = j + 1
            break
    else:
        local.append(a[i])

print(sum(local), len(local))
```

**Ответ:** 3851 32
