#### Условие:
> Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором наибольшее количеством подряд идущих мест, таких что все они уже распределены (заняты). В ответе запишите два целых числа: номер ряда и наибольшее количество подряд занятых мест.

#### Решение (Python)
```python
f = open('files/4859.txt')
n = int(f.readline())
d = {}
for i in range(n):
    x, y = map(int, f.readline().split())
    if x in d:
        d[x].append(y)
    else:
        d[x] = [y]

number, mx = 0, 0
for x in sorted(d):
    d[x] = sorted(d[x])
    m, k = 0, 1
    for y in range(1, len(d[x])):
        if d[x][y-1]+1 == d[x][y]:
            k += 1
            m = max(m, k)
        else:
            k = 1
    if m >= mx:
        mx = m
        number = x

print(number, mx)
```

**Ответ:** 99 14
