#### Условие:
> При проведении эксперимента заряженные частицы попадают на чувствительный экран, представляющий из себя матрицу размером 640 на 480 точек. При попадании очередной частицы на экран в файл записываются координаты чувствительного элемента: номер строки (целое число от 1 до 640) и номер позиции в строке (целое число от 1 до 480). Точка экрана, в которую попала хотя бы одна частица, считается светлой, точка, в которую ни одна частица не попала, – тёмной.
> 
> Вам нужно определить наибольшую длину цепочки в одной строке, состоящей только из светлых точек, и строку, в котором она находится. Если таких строк несколько, укажите максимальный из их номеров.

#### Решение (Python)
```python
f = open('files/4920.txt')
n = int(f.readline())
a = [[0]*481 for i in range(641)]
for i in range(n):
    x, y = map(int, f.readline().split())
    a[x][y] = 1

m, r = 0, 0
for x in range(1, 641):
    k = 0
    for y in range(1, 481):
        if a[x][y] == 1:
            k += 1
        else:
            if k >= m:
                m = k
                r = max(r, x)
            k = 0
print(m, r)
```

**Ответ:** 8 338
