#### Условие:

> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа A формула
> 
> (ДЕЛ(x, A) → ДЕЛ(x, 54) ∨ ДЕЛ(x, 130)) ∧ (A > 110)
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)? 

#### Решение (Python):
```python
def mod(n, m):
    return n % m == 0


def f(x, a):
    return ((mod(x, a) <= mod(x, 54)) or mod(x, 130)) and (a > 110)


mini = float('inf')
for a in range(1, 500):
    if all(f(x, a) for x in range(1, 800)):
        mini = min(mini, a)
print(mini)
```

**Ответ:** 130
