#### Условие:

> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наибольшего натурального числа A формула
> 
> ДЕЛ(120, A) ∧ ((ДЕЛ(x, 70) ∧ ДЕЛ(x, 30)) → ДЕЛ(x, A))
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?

#### Решение #1 (Python):
```python
def div(n, m):
    return n % m == 0


def f(a, x):
    return (div(120, a)) and ((div(x, 70) and div(x, 30)) <= div(x, a))


maxi = float('-inf')

for a in range(1, 500):
    if all(f(a, x) for x in range(-200, 500)):
        if a > maxi:
            maxi = a

print(maxi)
```

**Ответ:** 30
