#### Условие:

> Для какого наименьшего целого числа А выражение
> 
> ((x – 30 < A) ∧ (15 – y < A)) ∨ (x•(y+3) > 60)
> 
> тождественно истинно, т.е. принимает значение 1 при любых целых положительных x и y?

#### Решение (Python):
```python
def f(a, x, y):
    return (((x-30) < a) and ((15 - y) < a)) or ((x*(y+3)) > 60)


mini = float('inf')
for a in range(200):
    if all(f(a, x, y) for x in range(1, 300) for y in range(1, 300)):
        mini = min(mini, a)
print(mini)
```

**Ответ:** 15
