#### Условие:

> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Сколько существует натуральных значений A на отрезке [1;1000], при которых формула
> 
> ДЕЛ(A, 9) ∧ (ДЕЛ(280, x) → (¬ДЕЛ(A, x) → ¬ДЕЛ(730, x)))
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?

#### Решение #1 (Python)
```python
def div(n,m):
    return n % m == 0

def f(a, x):
    return div(a, 9) and (div(280, x) <= ((not div(a, x)) <= (not div(730, x))))

count = 0
for a in range(1, 1000):
    if all(f(a, x) == 1 for x in range(1, 1000)):
        count += 1
print(count)
```

**Ответ:** 11
