#### Условие:

> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Сколько существует натуральных значений A, при которых формула
> 
> ДЕЛ(A, 5) ∧ (¬ДЕЛ(2020, A) → (ДЕЛ(x, 1718) → ДЕЛ(2023, A)))
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?

#### Решение #1 (Python):
```python
def div(m,n):
    return m % n == 0

count = 0

for a in range(1, 3000):
    ok = True
    for x in range(3000):
        if not (div(a, 5) and ((not div(2020, a)) <= (div(x, 1718) <= div(2023, a)))):
            ok = False
            break
    if ok:
        count += 1

print(count)
```

#### Ответ: 6
