#### Условие:

> Обозначим через div(n, m) результат целочисленного деления натурального числа n на натуральное число m. Для какого наименьшего натурального числа А формула
> 
> (div(x, 50) > 3) ∨ ¬(div(x, 13) > 3) ∨ (div(x, A) > 6)
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)? 

#### Решение #1 (Python):
```python
def div(m,n):
    return m // n

arr = []

for a in range(1, 500):
    ok = True
    for x in range(500):
        if not (div(x, 50) > 3 or not (div(x, 13) > 3) or (div(x, a) > 6)):
            ok = False
            break
    if ok:
        arr.append(a)

print(min(arr))
```

#### Ответ: 1
