#### Условие:

> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наибольшего натурального числа А формула
> 
> ¬ (ДЕЛ(x, 16) ≡ ДЕЛ(x, 24)) → ДЕЛ(x, A)
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)? 

#### Решение #1 (Python):
```python
def div(n,m):
    return n % m == 0

arr = []

for a in range(1, 500):
    ok = True
    for x in range(500):
        if not ((not (div(x, 16) == div(x, 24))) <= div(x, a)):
            ok = False
            break
    if ok:
        arr.append(a)

print(max(arr))
```

#### Ответ: 8
