#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [3144472; 3144600], простые числа. Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку.

#### Решение #1 (Python):
```python
def isPrime(n):
    for i in range(2, int(n ** 0.5)):
        if n % i == 0:
            return False
    return True


idx = 1
for i in range(3144472, 3144600 + 1):
    if isPrime(i):
        print(idx, i)
        idx += 1
```

#### Ответ: 
```
1 3144509
2 3144527
3 3144529
4 3144539
5 3144551
6 3144571
7 3144587
8 3144599
```
