#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [4202865; 4202923], простые числа. Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку.

#### Решение #1 (Python):
```python
def isPrime(n):
    for i in range(2, int(n**0.5)):
        if n % i == 0:
            return False
    return True


idx = 1
for i in range(4202865, 4202923+1):
    if isPrime(i):
        print(idx, i)
        idx += 1
```

#### Ответ: 
```
1 4202897
2 4202899
3 4202903
4 4202911
5 4202923
```
