#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [268220; 270335] число c максимальной суммой делителей, имеющее не более четырех делителей. Для найденного числа выведите сумму делителей и количество делителей. 

#### Решение #1 (Python):
```python
def find_divisors(number):
    divisors = set()
    for divisor in range(1, int(number**0.5)+1):
        if number % divisor == 0:
            divisors.add(divisor)
            divisors.add(number / divisor)
    return divisors


a = []
for i in range(268220, 270335+1):
    divs = find_divisors(i)
    if len(divs) <= 4:
        a.append((int(sum(divs)), len(divs)))

print(max(a))
```

**Ответ:** 405456 4
