#### Условие:

> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [586132; 586430], числа, имеющие максимальное количество различных делителей. Найдите минимальное и максимальное из таких чисел. Для каждого из них в отдельной строчке выведите количество делителей и наибольший делитель, не равный самому числу. 

#### Решение #1 (Python):
```python
def find_divisors(number):
    divisors = set()
    for divisor in range(1, int(number**0.5)+1):
        if number % divisor == 0:
            divisors.add(divisor)
            divisors.add(number / divisor)
    return divisors


a = []
last_mx = 0
for i in range(586132, 586430+1):
    divs = find_divisors(i)
    if len(divs) >= last_mx:
        last_mx = len(divs)
        a.append((len(divs), int(sorted(divs)[-2])))

print(sorted(a)[::-1])
```

#### Ответ: 
```
80 293112
80 293160
```
