#### Условие:

> Элементами множеств А, P, Q являются натуральные числа, причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}, Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}.
> 
> Известно, что выражение
> 
> ((x ∈ P) → (x ∈ A)) ∨ (¬(x ∈ A) → ¬(x ∈ Q))
> 
> истинно (т. е. принимает значение 1) при любом значении переменной х. Определите наименьшее возможное значение суммы элементов множества A.

#### Решение #1 (Python):
```python
def f(x):
    return ((x in P) <= (x in A)) or ((x not in A) <= (x not in Q))


P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}
A = set()

for i in range(1, 1000):
    if not f(i):
        A.add(i)

print(sum(A))
```

#### Ответ: 36
