#### Условие:

> Элементами множества А являются натуральные числа. Известно, что выражение
> 
> (x ∈ {2, 4, 6, 8, 10, 12}) → (((x ∈ {3, 6, 9, 12, 15}) ∧ ¬(x ∈ A)) → ¬(x ∈ {2, 4, 6, 8, 10, 12}))
> 
> истинно (т. е. принимает значение 1) при любом значении переменной х. Определите наименьшее возможное значение суммы элементов множества A.

#### Решение #1 (Python):
```python
def f(x):
    return (x in {2, 4, 6, 8, 10, 12}) <= (((x in {3, 6, 9, 12, 15}) and (x not in A)) <= (x not in {2, 4, 6, 8, 10, 12}))


A = set()
for i in range(1, 100000):
    if not f(i):
        A.add(i)

print(sum(A))
```

#### Ответ: 18
