#### Условие:

> Элементами множеств А, P, Q являются натуральные числа, причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}, Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}. Известно, что выражение
> 
> ( (x ∈ A) → (x ∈ P) ) ∧ ( (x ∈ Q) → ¬(x ∈ A) )
> 
> истинно (то есть принимает значение 1) при любом значении переменной х. Определите наибольшее возможное количество элементов в множестве A.

#### Решение #1 (Python):
```python
def f(x):
    return ((x in A) <= (x in P)) and ((x in Q) <= (x not in A))


P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}
A = set(range(1, 1000))

for i in range(1, 1000):
    if not f(i):
        A.remove(i)

print(len(A))
```

#### Ответ: 7
