#### Условие:

> Ниже записана программа, которая вводит натуральное число x, выполняет преобразования, а затем выводит результат. 
> Укажите наименьшее значение x, при вводе которого программа выведет число 45.

#### Решение #1 (Python):
```python
arr = []
for i in range(78, 1000):
    x = i
    a = x - 61
    b = 3*x - 138
    while a != b:
      if a > b:
        a -= b
      else:
        b -= a
    if a == 45:
        arr.append(i)
print(min(arr))
```

#### Ответ: `106`
