#### Условие:

> Ниже записана программа, которая вводит натуральное число x, выполняет преобразования, а затем выводит результат. 
> Укажите наименьшее значение x, при вводе которого программа выведет число 34.

#### Решение #1 (Python):
```python
minX = 1000
for i in range(55, 1000):
    x = i
    a = 3*x - 112
    b = 3*x + 58
    while a != b:
      if a > b:
        a -= b
      else:
        b -= a
    if a == 34:
        minX = min(minX, i)
print(minX)
```

#### Ответ: `60`
