#### Условие:

> Ниже записана программа, которая вводит натуральное число x, выполняет преобразования, а затем выводит результат. 
> Укажите наименьшее значение x, при вводе которого программа выведет число 158.

#### Решение #1 (Python):
```python
arr = []
for i in range(100, 10000):
    x = i
    a = 3*x + 71
    b = 3*x - 87
    while a != b:
      if a > b:
        a -= b
      else:
        b -= a
    if a == 158:
        arr.append(i)

print(min(arr))
```

#### Ответ: `187`
