#### Условие:

> Ниже на трёх языках программирования записан алгоритм.
> Получив на вход число X, этот алгоритм печатает одно число. 
> Укажите наименьшее число Х, большее 80, при вводе которого алгоритм печатает число 17. 

#### Изначальный алгоритм на Python:
```python
x = int(input()) 
s = 0 
while x > 0: 
  s = s + x % 9 
  x = x // 3 
print(s)
```

#### Решение #1 (Python):
```python
arr = []
for i in range(81, 1000):
    x = i
    s = 0
    while x > 0:
      s = s + x % 9
      x = x // 3
    if s == 17:
        arr.append(i)

print(min(arr))
```

#### Ответ: `97`
