#### Условие:

> В файле 17-243.txt содержится последовательность целых чисел. 
> Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. 
> Определите количество пар чисел, в которых ровно один из двух элементов больше, чем сумма цифр всех чисел в файле, делящихся на 61, а десятичная запись другого оканчивается на 33. 
> В ответе запишите два числа: сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. 
> В данной задаче под парой подразумевается два идущих подряд элемента последовательности.

#### Решение #1 (Python):
```python
f = [int(i) for i in open('files/4721.txt').readlines()]
numSum = 0
count = 0
arr = []

for i in f:
    if i % 61 == 0:
        numSum += sum([int(n) for n in str(i)])

for i in range(len(f)-1):
    p1 = f[i]
    p2 = f[i+1]
    if p1 > numSum >= p2 and p2 % 100 == 33 and p1 % 100 != 33:
        count += 1
        arr.append(p1+p2)
    elif p2 > numSum >= p1 and p1 % 100 == 33 and p2 % 100 != 33:
        count += 1
        arr.append(p1+p2)

print(count, min(arr)) # >>> 40 5182
```

#### Ответ: 41 5182

> Примечание: почему-то первый ответ в задаче на 1 больше, чем результат работы программы. При этом, второй ответ полностью совпадает. Я не понял, с чем это связано, со своей стороны ошибок не нашёл.
