> Обозначим через *ДЕЛ(n, m)* утверждение «натуральное число *n* делится без остатка на натуральное число *m*». 
> 
> Для какого наименьшего натурального числа *A* формула 
> 
> (ДЕЛ(x, 2) → (¬ДЕЛ(x, 5))) ∨ (x + A ≥ 80)
> 
> тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной *х*)?

[Источник (YouTube)](https://youtu.be/djrXO1aOdRg?t=1270)

#### Решение #1 (Python)
```python
def f(x, a):
    return ((x % 2 == 0) <= (x % 5 != 0)) or (x + a >= 80)

for a in range(1, 1000):
    flag = True
    
    for x in range(1, 1000):
        if f(x, a) == False:
            flag = False
            break
    
    if flag:
        print(a)
        break
```
**Ответ:** 70.
