> Укажите наименьшее A, при котором значение истинно при неотрицательных x и y
>
> (4x + 5y > 33) V (x + y < A)

#### Решение #1 (Python)
```python
for a in range(-100, 100):
    flag = True

    for x in range(100):
        for y in range(100):
            if ((4 * x + 5 * y) > 33) or ((x + y) < a):
                pass
            else:
                flag = False
                break
    
    if flag:
        print( ' 7:', a )
        break
```

**Ответ:** 9.
