#### Условие:
> На числовой прямой даны два отрезка: В = [18; 52] и С = [16; 41]. Укажите наименьшую возможную длину такого отрезка А, что логическое выражение
> 
> ((x ∈ B) → (x ∈ A)) ∧ (¬(x ∈ C) ∨ (x ∈ A))
> истинно (т.е. принимает значение 1) при любом значении переменной х.

#### Решение (Python)
```python
from itertools import combinations

def f(x):
    return ((18 <= x <= 52) <= (a1 <= x <= a2)) and ((not (16 <= x <= 41)) or (a1 <= x <= a2))

oX = [i / 4 for i in range(0, 55*4)]
m = []
for a1, a2 in combinations(oX, 2):
    if all(f(x) for x in oX):
        m.append(a2-a1)

print(min(m))
```

**Ответ:** 36
