#### Условие:
> На числовой прямой даны два отрезка: В = [25; 40] и С = [12; 33]. Укажите наименьшую возможную длину такого отрезка А, что логическое выражение
> 
> ((x ∈ B) → (x ∈ A)) ∧ (¬(x ∈ C) ∨ (x ∈ A))
> истинно (т.е. принимает значение 1) при любом значении переменной х.

#### Решение (Python)
```python
from itertools import combinations

def f(x):
    return ((25 <= x <= 40) <= (a1 <= x <= a2)) and ((not (12 <= x <= 33)) or (a1 <= x <= a2))

m = []
oX = [i / 4 for i in range(0, 42*4)]
for a1, a2 in combinations(oX, 2):
    if all(f(x) for x in oX):
        m.append(a2-a1)

print(min(m))
```

**Ответ:** 28
