#### Условие:

> Сколько существует чисел, делящихся на 5, десятичная запись которых содержит 7 цифр, причём все цифры различны и никакие две чётные и две нечётные цифры не стоят рядом.

#### Решение #1 (Python):
```python
from itertools import product
chars = '1234567890'
count = 0

for n in product(chars, repeat=7):
    if len(n) == len(set(n)) and n[0] != '0' and int(''.join(n)) % 5 == 0:
        flag = True
        for i in range(len(n)-1):
            n1 = int(n[i])
            n2 = int(n[i+1])
            if (n1 % 2 == 0 and n2 % 2 == 0) or (n1 % 2 != 0 and n2 % 2 != 0):
                flag = False
                break
        if flag:
            count += 1

print(count)
```

**Ответ:** 2880
