#### Условие:

> Сколько существует четных пятеричных чисел длиной 6, начинающихся с цифры 3?

#### Решение #1 (Python):
```python
from itertools import product
count = 0
chars = '01234'

for n in product(chars, repeat=6):
    if int(''.join(n), 5) % 2 == 0 and n[0] == '3':
        count += 1

print(count)

```

**Ответ:** 1562
