#### Условие:

> Аня составляет 6-значные числа в 10-ичной системе счисления. Цифры в числе не должны повторяться, и никакие две четные или две нечетные цифры не должны стоять рядом. Сколько чисел может составить Аня?

#### Решение #1 (Python):
```python
from itertools import product
chars = '1234567890'
count = 0

for num in product(chars, repeat=6):
    if len(num) == len(set(num)) and num[0] != '0':
        flag = True
        for c in range(len(num)-1):
            if (int(num[c]) % 2 == 0 and int(num[c+1]) % 2 == 0) or (int(num[c]) % 2 != 0 and int(num[c+1]) % 2 != 0):
                flag = False
                break
        if flag:
            count += 1

print(count)
```

**Ответ:** 6480
