#### Условие:
> Полина составляет 5-значные числа в 5-ичной системе счисления, которые содержат не более 3 чётных цифр. Сколько различных чисел может составить Полина?

#### Решение #1 (Python):
```python
def nToFive(n):
    s = ''
    while n > 0:
        digit = n % 5
        n //= 5
        s = str(digit) + s
    return s


count = 0

for i in range(10000):
    numCount = 0
    num = nToFive(i)
    if len(num) == 5:
        for j in num:
            if int(j) % 2 == 0:
                numCount += 1
        if numCount <= 3:
            count += 1

print(count)
```

**Ответ:** 1744
