**Условие:**

Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [2422000; 2422080], простые числа. 
Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку.

**Решение:**

```python
otv = []
count = 0
for i in range(2422000, 2422080+1):
    d = 0
    for c in range(2, i):
        if i % c == 0:
            d += 1
    if d == 0:
        count += 1
        otv.append([count, i])
print(otv)
```

**Ответ:** ``[[2422027, 1], [2422033, 2], [2422037, 3], [2422073, 4]]``
