#### Условие:

> Сколько различных цифр в шестнадцатеричной записи числа 2<sup>51</sup> + 2<sup>40</sup> + 2<sup>35</sup> + 2<sup>17</sup> – 2<sup>5</sup>?

#### Решение #1 (Python):
```python
n = 2**51 + 2**40 + 2**35 + 2**17 - 2**5
nums = set()

for i in hex(n)[2:]:
    nums.add(i)

print(len(nums))
```

#### Ответ: 5
