#### Условие:

> Значение выражения 5<sup>2</sup>∙7<sup>25</sup> + 6<sup>2</sup>∙7<sup>36</sup> – 4<sup>2</sup>∙9<sup>3</sup> записали в семеричной системе счисления. Сколько нулей в такой записи?

#### Решение #1 (Python):
```python
n = 5 ** 2 * 7 ** 25 + 6 ** 2 * 7 ** 36 - 4 ** 2 * 9 ** 3
s = ''

while n > 0:
    s = str(n % 7) + s
    n //= 7

print(s.count('0'))
```

#### Ответ: 10
