#### Условие:

> Значение арифметического выражения 43∙7<sup>103</sup> – 21∙7<sup>57</sup> + 98 записали в системе счисления с основанием 7. Найдите сумму разрядов получившегося числа и запишите её в ответе в десятичной системе счисления.

#### Решение #1 (Python):
```python
n = 43 * 7 ** 103 - 21 * 7 ** 57 + 98
s = ''

while n > 0:
    s = str(n%7) + s
    n //= 7

print(sum([int(i) for i in s]))
```

#### Ответ: 276
