#### Условие:

> Значение выражения 3•11<sup>58</sup> + 15•11<sup>55</sup> – 99•11<sup>18</sup> + 125•11<sup>9</sup> + 381 записали в системе счисления с основанием 11. Сколько различных цифр содержится в этой записи?

#### Решение #1 (Python):
```python
n = 3 * 11 ** 58 + 15 * 11 ** 55 - 99 * 11 ** 18 + 125 * 11 ** 9 + 381
chars = {'10': 'a', '11': 'b'}
s = ''
while n > 0:
    if len(str(n % 11)) >= 2:
        s = chars[str(n % 11)] + s
    else:
        s = str(n % 11) + s
    n //= 11

print(len(set(s)))
```

#### Ответ: 7
