#### Условие:

> Значение выражения 11•15<sup>65</sup> + 18•15<sup>38</sup> – 14•15<sup>17</sup> + 19•15<sup>11</sup> + 18338 записали в системе счисления с основанием 15. Сколько различных цифр содержится в этой записи?

#### Решение #1 (Python):
```python
n = 11 * 15 ** 65 + 18 * 15 ** 38 - 14 * 15 ** 17 + 19 * 15 ** 11 + 18338
s = ''
chars = {'10': 'a', '11': 'b', '12': 'c', '13': 'd', '14': 'e'}

while n > 0:
    if len(str(n % 15)) >= 2:
        s = chars[str(n % 15)] + s
    else:
        s = str(n % 15) + s
    n //= 15

print(len(set(s)))
```

#### Ответ: 10
