#### Условие:
> Алгоритм вычисления значения функции F(n), где n – целое неотрицательное число, задан следующими соотношениями:
> 
> F(0) = 1, F(1) = 3
> 
> F(n) = F(n–1) – F(n–2) + 3n, при чётном n > 1
> 
> F(n) = F(n–2) – F(n–3) + 2n, при нечётном n > 1
> 
> Чему равно значение функции F(40)? В ответе запишите только целое число. 

#### Решение #1 (Python):
```python
def f(n):
    if n == 0:
        return 1
    if n == 1:
        return 3
    if n % 2 == 0 and n > 1:
        return f(n-1) - f(n-2) + 3 * n
    if n % 2 != 0 and n > 1:
        return f(n-2) - f(n-3) + 2 * n

print(f(40))
```

#### Ответ: `84`
