#### Условие:

> Текстовый файл состоит не более чем из 106 символов L, D и R. 
> Определите длину самой длинной последовательности, состоящей из символов R. Хотя бы один символ R находится в последовательности.
> 
> Для выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.

#### Решение #1 (Python)
```python
s = list(open('zadanie24_2(1).txt').readline())
length = 1
max_len = 0

for i in range(1, len(s)):
    if s[i] == s[i-1] == 'R':
        length += 1
    else:
        max_len = max(max_len, length)
        length = 1

print(max_len)
```

**Ответ:** 1.

#### Решение #2 (Python)
```python
f = open('24.txt')

s = f.readline()[:-2]
s = s.replace('L', ' ').replace('D', ' ').split()

maxlen = 0

for i in s:
	maxlen = max(maxlen, len(i))

print(maxlen)
```
**Ответ:** 1.
