#### Условие:

> Текстовый файл состоит не более чем из 106 символов A, B и C. Определите максимальное количество идущих подряд символов C.
> 
> Для выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма. 

#### Решение #1 (Python):
```python
s = open('24-sdm-2.txt.txt').readline()
l, mxl = 0, 0

for i in s:
    if i == 'C':
        l += 1
        mxl = max(mxl, l)
    else:
        l = 0
print(mxl)
```

#### Ответ: 1
