#### Условие:

> Текстовый файл содержит строки различной длины. Общий объём файла не превышает 1 Мбайт. Строки содержат только заглавные буквы латинского алфавита (ABC…Z). Определите количество строк, в которых буква A встречается чаще, чем буква E.
> 
> Для выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.

#### Решение #1 (Python):
```python
s = [i[:-1] for i in open('24-sdm-3.txt').readlines()]
count = 0

for i in s:
    if i.count('A') > i.count('E'):
        count += 1
print(count)
```

#### Ответ: 485
