#### Условие:

> Текстовый файл содержит только заглавные буквы латинского алфавита (ABC…Z). 
> Определите наибольшую длину цепочки символов, среди которых нет символов K и L, стоящих рядом.

#### Решение #1 (Python):
```python
f = open('24-3.txt').readline().replace('KL', 'K L').replace('LK', 'L K').split(' ')
maxLen = 0

for s in f:
    maxLen = max(maxLen, len(s))
print(maxLen)
```

#### Ответ: `2796`
