#### Условие:

> Текстовый файл состоит из символов P, Q, R и S.
> 
> Определите максимальное количество идущих подряд символов в прилагаемом файле, среди которых нет идущих подряд символов P.
> 
> Для выполнения этого задания следует написать программу.

#### Решение #1 (Python):
```python
s = open('24-sdm-1.txt').readline().replace('PP', 'P P').split(' ')

mxl = 0
for i in s:
    mxl = max(mxl, len(i))
print(mxl)
```

#### Ответ: 188
