### Тип 1

#### Тип 1.1
> Определите максимальное количество идущих подряд символов, среди которых каждые два соседних различны.

```python
f = open('24.txt')
s = f.readline()[:-2]
maxlen = 0 # максимальная длина
l = 1 # текущая длина
	
for i in range(1, len(s)):
	if s[i] != s[i - 1]:
		l += 1
		maxlen = max(maxlen, l)
	else:
		l = 1

print(maxlen)
```

[27421](27421.md), [27690](27690.md), [27695](27695.md)

#### Тип 1.2
> Определите максимальное количество идущих подряд символов, среди которых нет идущих подряд символов P.

[38602](38602.md)

### Тип 2
> Определите длину самой длинной последовательности, состоящей из символов X. Хотя бы один символ X находится в последовательности.

```python
f = open('24.txt')

s = f.readline()[:-2]
s = s.replace('Y', ' ').replace('Z', ' ')
s = s.split()

p = [len(i) for i in s]

print(max(p))
```

[27686](27686.md), [27687](27687.md), [27688](27688.md), [27696](27696.md), 
[27697](27697.md), [27698](27698.md)

### Тип 3
> Определите максимальную длину цепочки вида XYZXYZXYZ... (составленной из фрагментов XYZ, последний фрагмент может быть неполным).

```python
f = open('24.txt')

a = f.readline()
s = 'XYZ'

while (s in a):
    if s[-1] == 'X':
        s += 'Y'
    elif s[-1] == 'Y':
        s += 'Z'
    elif s[-1] == 'Z':
        s += 'X'

print( len(s) - 1 )
```

[27689](27689.md), [27694](27694.md), [27699](27699.md)

### Тип 4
> Определите максимальное количество идущих подряд символов A.

[27691](27691.md), [27692](27692.md), [27693](27693.md)

### Тип 5
> Определите количество строк, в которых буква E встречается чаще, чем буква A.

[29672](29672.md), [33103](33103.md)

### Тип 6

#### Тип 6.1
> Определите символ, который чаще всего встречается в файле сразу после буквы A.

```python
import re
f = open('24.txt')

a = f.readline()

l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
c = {}
for i in l:
	c[i] = 0

m = re.findall(r'A\w?', a)

for i in m:
	c[i[1]] += 1

print( max(c, key=c.get) ) 
```

[33196](33196.md), [33494](33494.md)

#### Тип 6.2
> Определите символ, который чаще всего встречается в файле *между* двумя одинаковыми символами.

```python
f = open('24.txt')

a = f.readline()

l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
s = {}
for j in l:
    s[j] = 0

for i in range(1, len(a) - 1):
    if a[i-1] == a[i+1]:
        s[ a[i] ] += 1

print(max(s, key=s.get))
```

[33526](33526.md)

#### Тип 6.3
> Определите символ, который чаще всего встречается в файле *после* двух одинаковых символов.

[33769](33769.md)

### Тип 7
> Необходимо найти строку, содержащую наименьшее количество букв G (если таких строк несколько, надо взять ту, которая находится в файле раньше), и определить, какая буква встречается в этой строке чаще всего. Если таких букв несколько, надо взять ту, которая позже стоит в алфавите.

[35482](35482.md), [35913](35913.md)

### Тип 8
> В строках, содержащих менее 25 букв A, нужно определить и вывести максимальное расстояние между одинаковыми буквами в одной строке.

```python
f = open('24.txt')
a = f.readlines()

maxdst = 0

for i in a:
	if i.count('A') < 25:
		
		dst = 0
		for j in i:
			if i.count(j) > 1:
				d = i.rfind(j) - i.find(j)
				dst = max(dst, d)
		
		maxdst = max(maxdst, dst)

print(maxdst)
```

[35998](35998.md), [36879](36879.md)

### Тип 9
> Определите максимальное количество идущих подряд символов, среди которых нет подстроки XZZY.

[36037](36037.md)

### Тип 10
> Определите наибольшую длину цепочки символов, среди которых нет символов K и L, стоящих рядом.

[37131](37131.md), [37159](37159.md)

### Тип 11
> Определите максимальное количество идущих подряд символов, среди которых не более одной буквы A.

[38958](38958.md), [39253](39253.md)

### Тип 12
> Определите максимальное количество идущих подряд символов, среди которых нет ни одной буквы A и при этом не менее трёх букв E.

[40740](40740.md), [40999](40999.md)
