#### Условие:

> Исполнитель К22 преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> 
> 1. Прибавь 1
> 2. Прибавь 4
> 3. Прибавь следующее чётное
> 
> Первая из них увеличивает число на экране на 1, вторая увеличивает число на 4. Третья команда прибавляет к числу следующее четное число (например, число 2 увеличивает на 4, а число 5 увеличивает на 6).
> Сколько существует программ, которые число 2 преобразуют в число 26, при этом траектория вычислений проходит через число 11 и не проходит через число 21?

#### Решение #1 (Python):
```python
def getNextEven(x):
    if x % 2 == 0:
        return x + 2
    if x % 2 != 0:
        return x + 1


def k22(x, y):
    if x > y or x == 21:
        return 0
    if x == y:
        return 1
    else:
        return k22(x + 1, y) + k22(x + 4, y) + k22(x + getNextEven(x), y)


print(k22(2, 11) * k22(11, 26))
```

#### Ответ: 493
