#### Условие:

> Исполнитель К22 преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> 
> 1. Прибавь 1
> 2. Прибавь 4
> 3. Прибавь факториал
> 
> Первая из них увеличивает число на экране на 1, вторая увеличивает число на 4. Факториалом числа N (обозначается как N!) называют произведение всех натуральных чисел от 1 до N. Третья команда увеличивает число на его факториал (например, для числа 3 будет получено 9 = 3 + 3!, так как 3! = 1·2·3 = 6). Программа для исполнителя – это последовательность команд. Сколько существует программ, которые преобразуют исходное число 1 в число 20, и при этом траектория вычислений содержит число 10?

#### Решение #1 (Python):
```python
from math import factorial as fact


def k22(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    else:
        return k22(x + 1, y) + k22(x + 4, y) + k22(x + fact(x), y)


print(k22(1, 10) * k22(10, 20))
```

#### Решение #2 (Python):
```python
def getFact(n):
    fact_num = 1
    for i in range(1, n + 1):
        fact_num *= i
    return fact_num


def k(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    else:
        return k(x + 1, y) + k(x + 4, y) + k(x + getFact(x), y)


print(k(1, 10) * k(10, 20))
```

#### Ответ: 378
