#### Условие

> Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 1?34567?9 и делящиеся на 17 без остатка. 
> 
> В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие им частные от деления на 17.

#### Решение 1 (Python)
```python
from itertools import product

for x, y in product("0123456789", repeat=2):
  n = int(f"1{x}34567{y}9")
  if n % 17 == 0:
    print(n, n // 17)
```

**Ответ:**
```
113456759 6673927
133456749 7850397
153456739 9026867
173456729 10203337
193456719 11379807
```

#### Решение #2 (Python)
```python
r = range(10)

for x in r:
	for y in r:
		n = '1' + str(x) + '34567' + str(y) + '9'
	
		if int(n) % 17 == 0:
			print(n, int(n) // 17)
```

**Ответ:**<br>
113456759 6673927<br>
133456749 7850397<br>
153456739 9026867<br>
173456729 10203337<br>
193456719 11379807.
