#### Условие:
> Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 123*567? и делящиеся на 169 без остатка. 
> 
> В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие им частные от деления на 169.

#### Решение 1 (Python)
```python
from itertools import product
a = set()
chars = '0123456789'

for y in product(chars, repeat=1):
    for i in range(0, 3):
        for x in product(chars, repeat=i):
            x = ''.join(x)
            y = ''.join(y)
            n = int(f'123{x}567{y}')
            if n % 169 == 0:
                a.add(n)

for i in sorted(a):
    print(i, i // 169)
```

**Ответ:**
```
12325677 72933
12385672 73288
123165679 728791
123225674 729146
123515678 730862
123575673 731217
123865677 732933
123925672 733288
```
