#### Условие:
> Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 123*567? и делящиеся на 169 без остатка. 
> 
> В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие им частные от деления на 169.

#### Решение 1 (Python)
```python
from itertools import product
digits = '1234567890'
a = set()

for i in range(6):
    for x in product(digits, repeat=i):
        for y in digits:
            a.add(int('123' +''.join(x) + '567' + y))

for i in sorted(a):
    if i <= 10**9 and i % 169 == 0:
        print(i, i // 169)
```

**Ответ:**
```
12325677 72933
12385672 73288
123165679 728791
123225674 729146
123515678 730862
123575673 731217
123865677 732933
123925672 733288
```
