#### Условие:
> Среди натуральных чисел, не превышающих 106, найдите все числа, соответствующие маске 12*45* и делящиеся на число 51 без остатка. 
> 
> В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие им частные от деления на 51.

#### Решение 1 (Python)
```python
from itertools import product
digits = '1234567890'
a = set()

for i in range(4):
    for j in range(4):
        for x in product(digits, repeat=i):
            for y in product(digits, repeat=j):
                a.add(int('12' + ''.join(x) + '45' + ''.join(y)))

for i in sorted(a):
    if i <= 10**6 and i % 51 == 0:
        print(i, i // 51)
```

**Ответ:**
```
122145 2395
122451 2401
124542 2442
124593 2443
127245 2495
```
