#### Условие:

> Логическая функция F задаётся выражением (x → w) ∧ (y → z) ∨ w. 
> Ниже приведён частично заполненный фрагмент таблицы истинности этой функции, содержащий неповторяющиеся строки. 
> 
> Сколькими способами можно поставить в соответствие переменные w, x, y, z столбцам таблицы истинности функции F, опираясь на информацию из данного фрагмента? 

#### Решение #1 (Python):
```python
print('w', 'x', 'y', 'z')
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if ((x <= w) and (y <= z)) == 0:
                    print(w, x, y, z)
```

#### Результат работы программы:
```
w x y z
0 0 1 0
0 1 0 0
0 1 0 1
0 1 1 0
0 1 1 1
1 0 1 0
1 1 1 0
```
#### Ответ: `3`
