> На вход алгоритма подаётся натуральное число *N*. Алгоритм строит по нему новое число *R* следующим образом:
> 
> 1) Строится двоичная запись числа *N*.
> 2) К этой записи дописываются справа ещё два разряда по следующему правилу? если *N* чётное, в конец числа (справа) дописывается сначала ноль, а затем единица. В противном случае, если *N* нечётное, справа дописывается сначала единица, а затем ноль.
>
>  Укажите минимальное число *R*, которое больше 102 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.

#### Решение #1 (Python)
```python
for i in range(1, 100):
    n = i
    # 1
    nbin = bin(n)[2:]

    # 2
    if n % 2 == 0:
        nbin += '01'
    else:
        nbin += '10'
    
    r = int('0b' + nbin, 2)

    if r > 102:
        print(r)
        break
```
**Ответ:** 105.
