#### Условие:
> На вход программы поступает последовательность из N пар целых положительных чисел. Необходимо выбрать из каждой пары число таким образом, чтобы сумма выбранных чисел не делилась на 5, при этом была максимальной возможной. 
> 
> Входные данные.  
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 120000). В каждой из последующих N строк записана пара целых положительных чисел, не превышающих 100. 
> Программа должна вывести в первой строке одно число: полученную сумму. 
> Если искомую сумму получить невозможно, нужно вывести “NO”. 

#### Решение А и Б методом частичных сумм (Python)
```python
f = open('files/108_B.txt')
n = int(f.readline())
s = [0]

for i in range(n):
    pair = map(int, f.readline().split())
    combinations = [a + b for a in pair for b in s]
    s = {x%5: x for x in sorted(combinations)}.values()

print(max(i for i in s if i % 5))
```

**Ответ:** 107 7989169
