#### Условие:
> На вход программы поступает последовательность из целых положительных чисел. Необходимо выбрать такую подпоследовательность подряд идущих чисел, чтобы их сумма была максимальной и делилась на 89, а также её длину. Если таких подпоследовательностей несколько, выбрать такую, у которой длина меньше.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 108). В каждой из последующих N строк записано одно целое положительное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/1869_A.txt')
n = int(f.readline())
a = [int(i) for i in f if i != ' ']
ms, ml = 0, float('inf')

for i in range(n):
    s = 0
    k = 0
    for j in range(i, n):
        s += a[j]
        k += 1
        if s % 89 == 0:
            if s > ms or (s == ms and k < ml):
                ms = s
                ml = k
print(ml)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/1869_B.txt')
n = int(f.readline())
m = [10**30]*89
k = [0]*89
s = 0
ms, ml = 0, -10**30

for i in range(n):
    x = int(f.readline())
    s += x
    if s % 89 == 0:
        if s > ms:
            ms = s
            ml = i + 1

    s1 = s - m[s%89]
    l1 = (i + 1) - k[s%89]
    if s1 > ms or (s1 == ms and l1 < ml):
        ms = s1
        ml = l1

    if s < m[s%89]:
        m[s%89] = s
        k[s%89] = i + 1

print(ml)
```

**Ответ:** 159 235660
