#### Условие:
> Набор данных представляет собой последовательность натуральных чисел. Необходимо выбрать такую подпоследовательность подряд идущих чисел, чтобы их сумма была максимальной и делилась на 69, и определить её длину. Гарантируется, что такая подпоследовательность существует. Если таких подпоследовательностей несколько, нужно выбрать подпоследовательность наименьшей длины.
> 
> **Входные данные.**
> Даны два входных файла, каждый из которых содержит в первой строке количество чисел N. Каждая из следующих N строк содержит натуральное число, не превышающее 10000.

#### Решение файла A (Python)
```python
f = open('files/1877_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms, ml = 0, float('inf')

for i in range(n):
    s = 0
    k = 0
    for j in range(i, n):
        s += a[j]
        k += 1
        if s % 69 == 0:
            if s > ms or (s == ms and k < ml):
                ms = s
                ml = k
print(ml)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/1877_B.txt')
n = int(f.readline())
m = [float('inf')]*69
k = [float('inf')]*69
ms, ml = 0, float('inf')
s = 0

for i in range(n):
    x = int(f.readline())
    s += x
    if s % 69 == 0:
        if s > ms or (s == ms and (i+1) < ml):
            ms = s
            ml = i+1

    s1 = s - m[s%69]
    l1 = (i+1) - k[s%69]
    if s1 > ms or (s1 == ms and l1 < ml):
        ms = s1
        ml = l1

    m[s%69] = min(m[s%69], s)
    k[s%69] = min(k[s%69], i+1)

print(ml)
```

#### Решение файла B методом частичных сумм (Python)
```python
f = open('files/1877_B.txt')
n = int(f.readline())
ms, ml = 0, float('inf')
s = [[0, 0]]

for i in range(n):
    x = int(f.readline())
    combinations = [[x+a, b+1] for a, b in s] + [[x, 1]]
    s = {j[0]%69: j for j in sorted(combinations)}.values()

    for summ, l in s:
        if summ % 69 == 0:
            if summ > ms or (summ == ms and l < ml):
                ms = summ
                ml = l
                break
print(ml)
```

**Ответ:** 14 99989
