#### Условие:
> Дана последовательность из N натуральных чисел. Рассматриваются все её непрерывные подпоследовательности, такие что сумма элементов каждой из них кратна k = 43. Найдите среди них подпоследовательность с максимальной суммой, определите её длину. Если таких подпоследовательностей найдено несколько, в ответе укажите количество элементов самой короткой из них.  
> 
> **Входные данные**
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10 000

#### Решение файла A (Python)
```python
f = open('files/1977_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms, ml = 0, float('inf')

for i in range(n):
    s, l = 0, 0
    for j in range(i, n):
        s += a[j]
        l += 1
        if s % 43 == 0:
            if (s > ms) or ((s == ms) and (l < ml)):
                ms = s
                ml = l
print(ml)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/1977_B.txt')
n = int(f.readline())
D = 43
prefs = [0]*D
prefl = [0]*D
ms, ml, s = 0, float('inf'), 0

for i in range(n):
    x = int(f.readline())
    s += x
    ost = s % 43

    if ost == 0 and s > ms:
        ms = s
        ml = i+1
    if prefs[ost] != 0:
        if (s - prefs[ost] > ms) or ((s - prefs[ost]) == ms and ((i - prefl[ost] + 1) < ml)):
            ms = s - prefs[ost]
            ml = i - prefl[ost] + 1
    if prefs[ost] == 0:
        prefs[ost] = s
        prefl[ost] = i+1

print(ml)
```
#### Решение файлов A и B методом частичных сумм (Python)
```python
f = open('files/1977_B.txt')
n = int(f.readline())
s = [[0, 0]]
ms, ml = 0, float('inf')

for i in range(n):
    x = int(f.readline())
    combinations = [[a+x, b+1] for a, b in s] + [[x, 1]]
    s = {x[0]%43: x for x in sorted(combinations)}.values()

    for summ, l in s:
        if summ % 43 == 0:
            if summ > ms or (summ == ms and l < ml):
                ms = summ
                ml = l
print(ml)
```

**Ответ:** 185 329329
