#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо узнать, сколько можно составить пар чисел таких, чтобы их сумма была четна и делилась на 5
> 
> Входные данные.
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 120000). В каждой из последующих N строк записано целое положительное число, не превышающее 1000.
> Программа должна вывести в первой строке одно число: полученное количество.

#### Решение файла A (Python)
```python
f = open('files/226_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
k = 0

for i in range(len(a)):
    for j in range(i+1, len(a)):
        if (a[i]+a[j]) % 2 == 0 and (a[i]+a[j]) % 5 == 0:
            k += 1
print(k)
```

#### Решение файла B (Python)
```python
f = open('files/226_B.txt')
n = int(f.readline())
D = 10
k = [0]*D
count = 0

for i in range(n):
    x = int(f.readline())
    for d in range(D):
        if (x+d) % 10 == 0:
            count += k[d]
    k[x%D] += 1

print(count)
```

**Ответ:** 15 5001021
