#### Условие:
> Дана последовательность из N натуральных чисел. Рассматриваются все её непрерывные подпоследовательности длиной не менее пяти элементов, такие что сумма элементов каждой из них кратна k = 117. Найдите количество таких подпоследовательностей.  
> 
> Входные данные
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10 000

#### Решение файла A (Python)
```python
f = open('files/2363_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
k = 0

for i in range(n):
    s = 0
    k5 = 0
    for j in range(i, n):
        s += a[j]
        k5 += 1
        if k5 >= 5 and s % 117 == 0:
            k += 1

print(k)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2363_B.txt')
n = int(f.readline())
m = [0]*117
k, s = 0, 0
q = []
for i in range(4):
    x = int(f.readline())
    s += x
    q.append(s)

for i in range(n-4):
    x = int(f.readline())
    s += x
    if s % 117 == 0:
        k += 1

    k += m[s%117]
    m[q[0]%117] += 1
    q.pop(0)
    q.append(s)

print(k)
```

**Ответ:** 34 42729434
