#### Условие:
> Дана последовательность из N целых чисел. Рассматриваются все её подмножества, такие что сумма элементов кратна 17. Найдите наибольшую сумму такого подмножества.
> 
> Входные данные
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 1 000 000). Каждая из следующих N строк содержит одно целое число, не превышающее по модулю 10 000.  Гарантируется что общая сумма любой выборки заданных чисел не превышает 2 ∙ 109 по абсолютной величине.

#### Решение файлов A и B методом частичных сумм (Python)
```python
f = open('files/2481_B.txt')
n = int(f.readline())
s = [0]

for i in range(n):
    x = int(f.readline())
    c = [i for i in s] + [x] + [x + a for a in s]
    s = {x%17: x for x in sorted(c)}.values()

print(max(i for i in s if i % 17 == 0))
```

**Ответ:** 42143 248359970
