#### Условие:
> Набор данных представляет собой последовательность целых чисел. Необходимо выбрать такую подпоследовательность подряд идущих чисел, чтобы их сумма была минимальной и делилась на 2077, и определить её длину. Гарантируется, что такая подпоследовательность существует. Если таких подпоследовательностей несколько, нужно выбрать подпоследовательность наибольшей длины.
> 
> **Входные данные.**
> Даны два входных файла, каждый из которых содержит в первой строке количество чисел N (100 ≤ N ≤ 5000000). Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/2904_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms, ml = float('inf'), float('-inf')

for i in range(n):
    s = 0
    l = 0
    for j in range(i, n):
        s += a[j]
        l += 1
        if s % 2077 == 0:
            if s < ms or (s == ms and (l > ml)):
                ms = s
                ml = l
print(ml)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2904_B.txt')
n = int(f.readline())
D = 2077
prefs = [0]*D
prefl = [0]*D
ms, ml = float('inf'), float('-inf')
s = 0

for i in range(n):
    x = int(f.readline())
    s += x
    ost = s % D
    if ost == 0:
        ms = min(ms, ost)
    if prefs[ost]:
        if (s - prefs[ost]) < ms or ((s - prefs[ost]) == ms and (i - prefl[ost] + 1) > ml):
            ms = s - prefs[ost]
            ml = i - prefl[ost] + 1
    if prefs[ost] == 0:
        prefs[ost] = s
        prefl[ost] = i + 1

print(ml)
```

#### Решение файла B методом частичных сумм (Python)
```python
f = open('files/2904_B.txt')
n = int(f.readline())
ms, ml = float('inf'), float('-inf')
s = [[0, 0]]

for i in range(n):
    x = int(f.readline())
    combinations = [[x+a, b+1] for a, b in s] + [[x, 1]]
    s = {x[0]%2077: x for x in sorted(combinations)[::-1]}.values()

    for summ, l in s:
        if summ % 2077 == 0:
            if summ < ms or (summ == ms and l > ml):
                ms = summ
                ml = l
                break
print(ml)
```

**Ответ:** 28 8208
