#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо определить количество пар чисел, произведение которых кратно 5, а сумма нечётна.
> 
> Входные данные.
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 10000). В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> Программа должна вывести в первой строке одно число: количество пар чисел, произведение которых кратно 5, а сумма нечётна

#### Решение файла A (Python)
```python
f = open('files/2722_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if a[i]*a[j] % 5 == 0 and (a[i]+a[j]) % 2:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2722_B.txt')
n = int(f.readline())
m = [0]*10
count = 0

for i in range(n):
    x = int(f.readline())
    for d in range(10):
        if x*d % 5 == 0 and (x+d) % 2:
            count += m[d]
    m[x%10] += 1
print(count)

```

**Ответ:** 1056 8863690
