#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо определить количество пар чисел, сумма которых кратна 131. 
> 
> Входные данные.
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 10000). В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> Программа должна вывести в первой строке одно число: количество пар чисел, сумма которых кратна 131

#### Решение файла A (Python)
```python
f = open('files/2724_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if (a[i]+a[j]) % 131 == 0:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2724_B.txt')
n = int(f.readline())
k = [0]*131
count = 0

for i in range(n):
    x = int(f.readline())
    ost = 0 if x % 131 == 0 else 131 - x % 131
    count += k[ost]
    k[x%131] += 1
print(count)
```

**Ответ:** 31 381543
