#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо определить максимальную нечётную сумму пары. 
> 
> Входные данные.
> 
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 10000). В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> Программа должна вывести в первой строке одно число: максимальную нечётную сумму пары

#### Решение файла A (Python)
```python
# Решение A
f = open('files/2726_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = 0

for i in range(n):
    for j in range(i+1, n):
        if (a[i]+a[j]) % 2:
            ms = max(ms, a[i]+a[j])
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/2726_B.txt')
n = int(f.readline())
k = [-10**30]*2
ms = 0

for i in range(n):
    x = int(f.readline())
    for d in range(2):
        if (x+d) % 2:
            ms = max(ms, x+k[d])
    k[x%2] = max(k[x%2], x)
print(ms)
```

**Ответ:** 73319 133981
