#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо определить минимальное произведение пары чисел, кратное 31. 
> 
> Входные данные.
> 
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 10000). В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> Программа должна вывести в первой строке одно число: минимальное произведение пары чисел, кратное 31

#### Решение файла A (Python)
```python
f = open('files/2727_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = float('inf')

for i in range(n):
    for j in range(i+1, n):
        if a[i]*a[j] % 31 == 0:
            ms = min(ms, a[i]*a[j])
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/2727_B.txt')
n = int(f.readline())
k = [10**30]*31
ms = float('inf')

for i in range(n):
    x = int(f.readline())
    for d in range(31):
        if x*d % 31 == 0:
            ms = min(ms, x*k[d])
    k[x%31] = min(k[x%31], x)
print(ms)
```

**Ответ:** 21831874 3472
