#### Условие:
> На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности. Необходимо определить максимальную чётную сумму пары чисел, среди которых есть хотя бы один кратный 23. 
> Входные данные.
> 
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 10000). В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> Программа должна вывести в первой строке одно число: максимальную чётную сумму пары чисел, среди которых есть хотя бы один кратный 23.

#### Решение файла A (Python)
```python
f = open('files/2728_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = 0

for i in range(n):
    for j in range(i+1, n):
        if (a[i]+a[j]) % 2 == 0 and (a[i] % 23 == 0 or a[j] % 23 == 0):
            ms = max(ms, a[i]+a[j])
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/2728_B.txt')
n = int(f.readline())
k = [-10**30]*2
k23 = [-10**30]*2
ms = 0

for i in range(n):
    x = int(f.readline())
    ost = 0 if x % 2 == 0 else 2 - x % 2
    if x % 23 == 0:
        ms = max(ms, x+k[ost])
        k23[x%2] = max(k23[x%2], x)
    else:
        ms = max(ms, x+k23[ost])
    k[x%2] = max(k[x%2], x)
print(ms)
```

#### Решение файла B (C++):
```cpp
#include<iostream>
#include<fstream>
#include<vector>

using namespace std;

int main() {
	int n;
	ifstream f("27B(1).txt");
	f >> n;
	vector<int> a(n);
	for (int i=0;i<n;i++) f >> a[i];
	long long mx = 0;
	
	for (int i=0; i<n;i++) {
		for (int j=i+1;j<n;j++) {
			if (a[i]%23==0 || a[j]%23==0) {
				if (((a[i]+a[j])%2==0) && (a[i]+a[j])>mx) {
					mx = a[i]+a[j];
				}
			}
		}
	}
	
	cout << mx << endl;
	return 0;
}
```

**Ответ:** 65406 133892
