#### Условие:
> Дана последовательность N целых положительных чисел. Необходимо определить количество пар элементов этой последовательности, сумма которых делится на m = 80 и при этом хотя бы один элемент из пары больше b = 50000
> 
> Описание входных и выходных данных
> 
> Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке входных данных количество чисел N (2 ≤ N ≤ 10 000). В каждой из последующих N строк записано одно натуральное число, не превышающее 100 000

#### Решение файла A (Python)
```python
f = open('files/2733_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if (a[i]+a[j]) % 80 == 0 and (a[i] > 50000 or a[j] > 50000):
            count += 1
print(count)
```

#### Решение файла B (C++)
```cpp
#include<iostream>
#include<fstream>
#include<vector>
#include<ctime>
using namespace std;

int main() {
	int n;
	ifstream f("2733_B.txt");
	f >> n;
	vector<int> a(n);
	for (int i=0;i<n;i++) f >> a[i];
	long long count = 0;
	
	for (int i=0;i<n;i++) {
		for (int j=i+1;j<n;j++) {
			if ((a[i]+a[j])%80==0 && (a[i]>50000 || a[j]>50000)) {
				count++;
			}
		}
		if (i%50000==0) cout << i << ' ' << clock()/60000. * (n-i)/i << endl;
	}
	
	cout << count << endl;
}
```

**Ответ:** 48 465486
