#### Условие:
> В вход программы поступают N натуральных чисел, каждое из которых не превышает 100 000. Необходимо определить количество пар элементов (ai, aj) этого набора, в которых 1 ≤ i < j  ≤ N, сумма элементов нечётна, произведение делится на 13, а номера чисел в последовательности отличаются не менее, чем на 5. Напишите эффективную по времени и по памяти программу для решения этой задачи
> 
> Описание входных и выходных данных
> 
> В первой строке входных данных задаётся количество чисел N. В каждой из последующих N строк записано одно натуральное число, не превышающее 100 000.

#### Решение файла A (Python)
```python
f = open('files/2751_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if (a[i]+a[j]) % 2 and a[i]*a[j] % 13 == 0 and j-i >= 5:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2751_B.txt')
n = int(f.readline())
k = [0]*26
q = [int(f.readline()) for i in range(4)]
count = 0

for i in range(n-4):
    x = int(f.readline())
    for d in range(26):
        if (x+d) % 2 and x*d % 13 == 0:
            count += k[d]
    k[q[0]%26] += 1
    q.pop(0)
    q.append(x)
print(count)
```

**Ответ:** 388 3773226
