#### Условие:
> На вход программы поступает последовательность из N натуральных чисел. Рассматриваются все пары различных элементов последовательности (элементы пары не обязательно должны стоять в последовательности рядом, порядок в паре неважен). Необходимо определить количество пар, для которых произведение элементов заканчивается на 3, а номера чисел в последовательности отличаются не менее, чем на 6.
> 
> Описание входных и выходных данных
> 
> В первой строке входных данных задается количество чисел N. В каждой из последующих N строк записано одно целое положительное число, не превышающее 100 000.
> 
> В качестве ответа программа должна вывести одно число: количество пар, в которых произведение элементов заканчивается на 3, а номера чисел в последовательности отличаются не менее, чем на 6

#### Решение файла A (Python)
```python
f = open('files/2752_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if a[i]*a[j] % 10 == 3 and j-i >= 6:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2752_B.txt')
n = int(f.readline())
k = [0]*10
q = [int(f.readline()) for i in range(5)]
count = 0

for i in range(n-5):
    x = int(f.readline())
    for d in range(10):
        if x*d % 10 == 3:
            count += k[d]
    k[q[0]%10] += 1
    q.pop(0)
    q.append(x)
print(count)
```

**Ответ:** 148 1982659
