#### Условие:
> На вход программы поступают N натуральных чисел, каждое из которых не превышает 100 000. Необходимо определить количество пар элементов (ai, aj) этого набора, в которых 1 ≤ i < j  ≤ N, произведение этих чисел делится на 23, а номера чисел в последовательности отличаются не менее, чем на 9. Напишите эффективную по времени и по памяти программу для решения этой задачи
> 
> Описание входных и выходных данных
> 
> В первой строке входных данных задаётся количество чисел N. В каждой из последующих N строк записано одно натуральное число, не превышающее 100 000.

#### Решение файла A (Python)
```python
f = open('files/2757_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if j-i >= 9 and a[i]*a[j] % 23 == 0:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2757_B.txt')
n = int(f.readline())
k = [0]*23
q = [int(f.readline()) for i in range(8)]
count = 0

for i in range(n-8):
    x = int(f.readline())
    for d in range(23):
        if x*d % 23 == 0:
            count += k[d]
    k[q[0]%23] += 1
    q.pop(0)
    q.append(x)
print(count)
```

**Ответ:** 83 4410535
