#### Условие:
> Для заданной последовательности неотрицательных целых чисел необходимо найти максимальное произведение двух её элементов, номера которых различаются не менее чем на 8. Значение каждого элемента последовательности не превышает 1000. Количество элементов последовательности не превышает 1 000 000.
> Входные данные представлены следующим образом. В первой строке задаётся число N – общее количество элементов последовательности. Гарантируется, что N > 8. В каждой из следующих N строк задаётся одно неотрицательное целое число – очередной элемент последовательности.

#### Решение файла A (Python)
```python
f = open('files/282_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 0

for i in range(len(a)-1):
    for j in range(i+1, len(a)):
        if abs(j - i) >= 8:
            m = max(m, a[i]*a[j])
print(m)
```

#### Решение файла B (Python)
```python
f = open('files/282_B.txt')
n = int(f.readline())
buf = [int(f.readline()) for i in range(8)]
m = float('-inf')

for i in range(n-8-1):
    x = int(f.readline())
    m = max(m, x*buf[0])
    buf += [x]
    buf.remove(min(buf[0], buf[1]))

print(m)
```

**Ответ:** 583263 998001
