#### Условие:
> Дана последовательность натуральных чисел. Необходимо определить количество её непрерывных подпоследовательностей, сумма элементов которых кратна 666.
> 
> **Входные данные**
> Первая строка входного файла содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число

#### Решение файла A (Python)
```python
f = open('files/2900_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 0

for i in range(n):
    s = 0
    for j in range(i, n):
        s += a[j]
        if s % 1000 == 0 and s > m:
            m = s
print(m)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2900_B.txt')
n = int(f.readline())
D = 1000
k = [0]*D
s, m = 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    ost = s % D

    if ost == 0:
        m = max(m, s)
    if k[ost]:
        if (s - k[ost]) > m:
            m = s - k[ost]
    if k[ost] == 0:
        k[ost] = s

print(m)
```

#### Решение файла B методом частичных сумм
```python
f = open('files/2900_B.txt')
n = int(f.readline())
m = 0
s = []

for i in range(n):
    x = int(f.readline())
    combinations = [a+x for a in s] + [x]
    s = {x%1000: x for x in sorted(combinations)}.values()

    for summ in s:
        if summ % 1000 == 0 and summ > m:
            m = summ

print(m)
```

**Ответ:** 259000 49763000
