#### Условие:
> Дана последовательность натуральных чисел. Необходимо определить количество её непрерывных подпоследовательностей, сумма элементов которых кратна 666.
> 
> **Входные данные**
> Первая строка входного файла содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число

#### Решение файла A
```python
f = open('files/2901_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
k = 0

for i in range(n):
    s = 0
    for j in range(i, n):
        s += a[j]
        if s % 666 == 0:
            k += 1
print(k)
```

#### Решение файла B методом префиксных сумм
```python
f = open('files/2901_B.txt')
n = int(f.readline())
D = 666
k = [0]*D
s, count = 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if s % D == 0:
        count += 1
    count += k[s%D]
    k[s%D] += 1

print(count)
```

**Ответ:** 5 75150
