#### Условие:
> Дана последовательность натуральных чисел. Известно, что сумма всех чисел последовательности не превышает 109. Рассматриваются все её непрерывные подпоследовательности, в которых количество чисел, делящихся на 5, кратно 11. Найдите количество таких подпоследовательностей.
> 
> Входные данные.
> Даны два входных файла, каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 100000). Каждая из следующих N строк файлов содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/2902_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
k = 0

for i in range(n):
    s = 0
    k5 = 0
    for j in range(i, n):
        s += a[j]
        if a[j] % 5 == 0:
            k5 += 1
        if k5 % 11 == 0:
            k += 1
print(k)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2902_B.txt')
n = int(f.readline())
m = [0]*11
k, k5, s = 0, 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if x%5 == 0:
        k5 += 1
    if k5 % 11 == 0:
        k += 1

    k += m[k5%11]
    m[k5%11] += 1

print(k)
```

**Ответ:** 588 4557520
