#### Условие:
> На вход программе подается последовательность натуральных чисел. Особым числом называется число, делящееся на 3. Рассматриваются все непрерывные подпоследовательности исходной последовательности, содержащие ровно 10 особых чисел. Программа должна вывести одно число – минимальную сумму элементов такой подпоследовательности.
> 
> **Входные данные.** Даны два входных файла, каждый из которых содержит в первой строке количество чисел N (100 ≤ N ≤ 5000000). Каждая из следующих N строк файлов содержит одно целое число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/2903_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = float('inf')

for i in range(n):
    s = 0
    k = 0
    for j in range(i, n):
        s += a[j]
        if a[j] % 3 == 0:
            k += 1
        if k == 10 and s < ms:
            ms = s
print(ms)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2903_B.txt')
n = int(f.readline())
m = [float('-inf')]*n
ms = float('inf')
s = 0
k = 0

for i in range(n):
    x = int(f.readline())
    s += x
    if x % 3 == 0:
        k += 1
    if k == 10:
        ms = min(ms, s)

    s1 = s - m[k-10]
    if s1 < ms:
        ms = s1

    m[k] = max(m[k], s)

print(ms)
```

**Ответ:** 103193 47337
