#### Условие:
> Дана последовательность целых чисел. Необходимо найти максимально возможную сумму её непрерывной подпоследовательности, в которой количество положительных чётных элементов кратно k = 30
> 
> Входные данные
> Первая строка входного файла содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число

#### Решение файла A (Python)
```python
f = open('files/2907_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 0

for i in range(n):
    s = 0
    k = 0
    for j in range(i, n):
        s += a[j]
        if a[j]>0 and a[j]%2==0:
            k += 1
        if k % 30 == 0:
            m = max(m, s)
print(m)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2907_B.txt')
n = int(f.readline())
m = [10**30]*30
ms, s, k = 0, 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if x>0 and x%2==0:
        k += 1
    if k % 30 == 0:
        ms = max(ms, s)

    s1 = s - m[k%30]
    ms = max(ms, s1)

    m[k%30] = min(m[k%30], s)

print(ms)
```

**Ответ:** 21365 286527
