#### Условие:
> Дана последовательность целых чисел. Рассматриваются все её непрерывные подпоследовательности длиной не менее семи элементов, такие что количество положительных чисел кратных 7 делится на 7. Найдите наибольшую сумму такой подпоследовательности.
> 
> Входные данные
> Первая строка входного файла содержит целое число N – общее количество чисел в наборе. Каждая из следующих N строк содержит одно число

#### Решение файла A (Python)
```python
f = open('files/2908_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 0

for i in range(n):
    s = 0
    k = 0
    k7 = 0
    for j in range(i, n):
        s += a[j]
        k += 1
        if a[j] > 0 and a[j] % 7 == 0:
            k7 += 1
        if k >= 7 and k7 % 7 == 0:
            m = max(m, s)
print(m)
```

#### Решение файла B методом префиксных сумм (Python)
```python
f = open('files/2908_B.txt')
n = int(f.readline())
m = [10**30]*7
q = []
ms, s, k7, = 0, 0, 0

for i in range(6):
    x = int(f.readline())
    s += x
    if x > 0 and x % 7 == 0:
        k7 += 1
    q.append([s, k7])

for i in range(n-6):
    x = int(f.readline())
    s += x
    if x > 0 and x % 7 == 0:
        k7 += 1
    if k7 % 7 == 0:
        ms = max(ms, s)

    s1 = s - m[k7%7]
    ms = max(ms, s1)

    m[q[0][1]%7] = min(m[q[0][1]%7], q[0][0])
    q.pop(0)
    q.append([s, k7])

print(ms)
```

**Ответ:** 48451 290112
