#### Условие:
> Дана последовательность из N натуральных чисел. Рассматриваются все её непрерывные подпоследовательности, такие что сумма элементов каждой из них кратна k = 67. Найдите среди них подпоследовательность с максимальной суммой. Укажите в ответе найденную максимальную сумму.
> 
> Входные данные
> Даны два входных файла (файл А и файл В), каждый из которых содержит в первой строке количество чисел N (1 < N < 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10 000

#### Решение файла A (Python)
```python
f = open('files/2945_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 0

for i in range(n):
    s = 0
    for j in range(i, n):
        s += a[j]
        if s % 67 == 0:
            m = max(m, s)

print(m)
```

#### Решение файла B методом префиксных сумм [1 способ] (Python)
```python
f = open('files/2945_B.txt')
n = int(f.readline())
k = 67
m = [10**30]*k
s, ms = 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if s % k == 0:
        ms = max(ms, s)
    s1 = s - m[s%k]
    ms = max(ms, s1)
    m[s%k] = min(m[s%k], s)

print(ms)
```

#### Решение файла B методом префиксных сумм [2 способ] (Python)
```python
f = open('files/2945_B.txt')
n = int(f.readline())
D = 67
k = [0]*D
m, s = 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    ost = s % D
    if ost == 0:
        m = max(m, s)
    if k[ost] != 0:
        if s - k[ost] > m:
            m = s - k[ost]
    if k[ost] == 0:
        k[ost] = s

print(m)
```

**Ответ:** 649565 208957389
