#### Условие:
> В файле записана последовательность натуральных чисел. Рассматриваются всевозможные группы чисел, состоящие из любого количества элементов последовательности. Необходимо найти количество таких групп, для которых сумма элементов оканчивается на 5.
> 
> Входные данные. Даны два входных файла, каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 100000).

#### Решение файлов A и B методов частичных сумм (Python)
```python
f = open('files/2949_B.txt')
n = int(f.readline())
k = [0]*10

for i in range(n):
    x = int(f.readline())
    k1 = k.copy()
    k1[x%10] += 1
    for j in range(10):
        k1[(j+x)%10] += k[j]
    k = k1

print(k[5])
```

**Ответ:** 115 107374272
