#### Условие:
> Со спутника, наблюдающего за Солнцем, была передана серия показаний датчика, снятых через равные промежутки времени. Для их анализа в начале отбирается контрольная группа - самая длинная непрерывная последовательность показаний с суммой значений, не превышающей некоторое пороговое значение K. Определите количество элементов в контрольной группе для полученной серии показаний.
> 
> Входные данные
> Дано два входных файла (файл А и файл В), каждый из которых в первой строке содержит два числа: N (1 ⩽ N ⩽ 10 000 000) - общее количество показаний и K (1 ⩽ N ⩽ 10 000 000) - пороговое значение для контрольной группы. В каждой из следующих N строк находится число - показание датчика (все числа натуральные, значение показания не превышает 1000). Числа указаны в порядке получения сигналов
> 
> В ответе укажите два числа: сначала значение искомой величины для файла А, зачем - для файла В.

#### Решение файла А (Python)
```python
f = open('27A.txt')
n, k = map(int, f.readline().split())
a = [int(i) for i in f]
m = 0

for i in range(len(a)-1):
    c = [a[i]]
    for j in range(i+1, len(a)):
        if sum(c)+a[j] <= k:
            c += [a[j]]
            m = max(m, len(c))
        else:
            c = [a[j]]
print(m)
```

#### Решение файла B (Python)
```python
f = open('27B(1).txt')
n, k = map(int, f.readline().split())
a = [int(i) for i in f]
m, s, c, st = 0, 0, 0, 0

for i in range(len(a)-1):
    s += a[i]
    c += 1
    if s <= k:
        m = max(m, c)
    else:
        while s > k:
            s -= a[st]
            c -= 1
            st += 1
            m = max(m, c)
print(m)
```

**Ответ:** 38 14918
