#### Условие:
> Имеется набор данных, состоящий из троек положительных целых чисел. Необходимо выбрать из каждой тройки два числа так, чтобы сумма всех выбранных чисел делилась на 4 и при этом была максимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число – максимально возможную сумму, соответствующую условиям задачи.
> 
> Входные данные: Даны два входных файла: файл A и файл B, каждый из которых содержит в первой строке количество троек N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит три натуральных числа, не превышающих 10 000.

#### Решение файлов A и B методом частичных сумм (Python)
```python
f = open('files/682_B.txt')
n = int(f.readline())
s = [0]

for i in range(n):
    x, y, z = map(int, f.readline().split())
    pairs = [x+y, y+z, x+z]
    combinations = [a+b for a in pairs for b in s]
    s = {x%4: x for x in sorted(combinations)}.values()

print(max(i for i in s if i % 4 == 0))
```

**Ответ:** 18380 58701760
