#### Условие:
> Имеется набор данных, состоящий из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма всех выбранных чисел оканчивалась на 8 и при этом была максимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число – максимально возможную сумму, соответствующую условиям задачи.
> 
> Входные данные. Даны два входных файла, каждый из которых содержит в первой строке количество пар N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 10 000.
#### Решение файлов А и B методом частичных сумм (Python)
```python
f = open('files/906_B.txt')
n = int(f.readline())
s = [0]

for i in range(n):
    pair = map(int, f.readline().split())
    combinations = [a + b for a in pair for b in s]
    s = {x%10: x for x in sorted(combinations)}.values()

print(max(i for i in s if i % 10 == 8))
```

**Ответ:** 13608 40724928
