#### Условие:
> Имеется набор данных, состоящий из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма всех выбранных чисел в шестнадцатеричной системе счисления оканчивалась на F и при этом была минимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число – минимально возможную сумму, соответствующую условиям задачи.
> 
> Входные данные. Даны два входных файла, каждый из которых содержит в первой строке количество пар N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 10 000.

#### Решение файлов A и B методом частичных сумм (Python)
```python
f = open('files/908_B.txt')
n = int(f.readline())
s = [0]

for i in range(n):
    pair = map(int, f.readline().split())
    combinations = [a + b for a in pair for b in s]
    s = {x%16: x for x in sorted(combinations)[::-1]}.values()

print(min(i for i in s if hex(i)[-1] == 'f'))
```

**Ответ:** 6495 20191039
