#### Условие:

> Обозначим через M разность максимального и минимального числа среди простых делителей целого числа, не считая самого числа. 
> Если таких делителей у числа нет, то считаем значение M равным нулю. 
> 
> Напишите программу, которая перебирает целые числа, большие 450000, в порядке возрастания и ищет среди них такие, для которых значение M при делении на 29 даёт в остатке 11. 
> Выведите первые 4 найденных числа в порядке возрастания, справа от каждого числа запишите соответствующее значения M. 

#### Решение #1 (Python):
```python
def isPrime(n):
    for j in range(2, n//2+1):
        if n % j == 0:
            return False
    return True
 
count = 0
for i in range(450000, 800000):
    if count == 4:
        break
    m = 0
    primeDels = []
    for c in range(2, i//2+1):
        if i % c == 0 and isPrime(c):
            primeDels.append(c)
    if len(primeDels) > 0:
        m = max(primeDels) - min(primeDels)
        if m % 29 == 11:
            count += 1
            print(i, m)
```

#### Ответ:
```
450006 417
450038 5231
450047 2650
450051 736
```
