#### Условие:

> Обозначим через F целую часть среднего арифметического всех простых делителей целого числа, не считая самого числа. 
> Если таких делителей у числа нет, то считаем значение F равным нулю. 
> 
> Напишите программу, которая перебирает целые числа, большие 650000, в порядке возрастания и ищет среди них такие, для которых значение F при делении на 37 даёт в остатке 23. 
> 
> Выведите первые 4 найденных числа в порядке возрастания и справа от каждого числа – соответствующее значение F. 

#### Решение #1 (Python):
```python
from math import floor

def isPrime(n):
    for j in range(2, n//2+1):
        if n % j == 0:
            return False
    return True

count = 0

for i in range(650000, 800000):
    if count == 4:
        break
    f = 0
    prime_dels = []
    for c in range(2, i//2+1):
        if i % c == 0 and isPrime(c):
            prime_dels.append(c)
    if len(prime_dels) > 0:
        f = int(floor(sum(prime_dels) / len(prime_dels)))

    if f % 37 == 23:
        count += 1
        print(i, f)

```

#### Ответ:
```
650090 60
650153 282
650155 3945
650208 134
```
