#### Условие:

> Исполнитель Умножитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
> 
> 1. Умножить на 2
> 2. Умножить на 3
> 
> Первая команда увеличивает число на экране в 2 раза, вторая – увеличивает значение в 3 раза. 
> 
> Сколько существует программ, для которых при исходном числе 8 результатом является число 3456, и при этом траектория вычислений содержит число 96. 

#### Решение #1 (Python):
```python
def k(x, y):
    if x > y:
        return 0
    elif x == y:
        return 1
    else:
        return k(x*2, y) + k(x*3, y)


print(k(8, 96) * k(96, 3456))
```

#### Ответ: `18`
