#### Условие:

> Дана программа для исполнителя Редактор:
> 
```
НАЧАЛО
ПОКА нашлось(1) или нашлось(100)
  ЕСЛИ нашлось(100)
    ТО заменить(100, 0001)
    ИНАЧЕ заменить(1, 00)
  КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
КОНЕЦ
```
> На вход приведённой ниже программе поступает строка, состоящая из единицы и идущих за ней 33 нулей. Сколько нулей будет в строке, которая получится после выполнения программы? 

#### Решение #1 (Python):
```python
s = '1' + '0' * 33
while '1' in s or '100' in s:
    if '100' in s:
        s = s.replace('100', '0001', 1)
    else:
        s = s.replace('1', '00', 1)
print(s.count('0'))
```

#### Ответ: `51`
