#### Условие:

> На вход программе подана строка, содержащая только 20 двоек, 15 троек и 10 четверок. Порядок символов заранее неизвестен. Определите максимально возможную сумму всех цифр в конечной строке.

#### Решение #1 (Python):
```python
s = '32' * 15 + '42' * 5 + '4'*5

while '42' in s or '32' in s:
    if '42' in s:
        s = s.replace('42', '51', 1)
    else:
        s = s.replace('32', '61', 1)

print(sum(int(i) for i in s))
```

**Ответ:** 155
