#### Условие:

> Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки символов.
> Известно, что начальная строка состоит более чем из 250 цифр 5 и не содержит других цифр. При какой наименьшей длине исходной строки результат работы этой программы будет содержать наименьшее возможное число цифр 5?

#### Решение #1 (Python):
```python
for i in range(251, 400):
    s = '5'*i
    while '55555' in s:
        s = s.replace('55555', '88', 1)
        s = s.replace('888', '555', 1)
    print(i, s.count('5'))
```

**Ответ:** 258
