#### Условие:

> Сколько существует значений s, подаваемых на вход программе, при которых в результате работы программы на экран будет выведено значение 125? 

#### Решение #1 (Python):
```python
count = 0

for i in range(1000):
    n = 1
    s = i
    while s > n:
      s = s - 15
      n = n * 5
    if n == 125:
        count += 1

print(count)
```

#### Ответ: `115`
