#### Условие:

> Определите, сколько существует различных значений переменной x, при вводе которых программа выведет число 231.


#### Решение #1 (Python):
```python
count = 0
i = 354170107
while True:
    i += 1
    x = i
    a = 0
    n = 987
    while (x + n) // 1000 < 354261:
        a += 1
        x = x - 5
        n = n + 8
        # if a > 28875:
        #     break

    if n // 1000 == 231:
        count += 1
        print(count)
    if n // 1000 < 231:
        break

print(count)
```

#### Ответ: 375

> Примечание: к этому решению пришли аналитически (через решение неравенства и т.д.) + подбором возможного числа i
