#### Значение выражения 216^6 + 216^4 + 36^6 − 6^14 − 24 записали в системе счисления с основанием 6. Сколько различных цифр содержит эта запись?
```python
s = 216 ** 6 + 216 ** 4 + 36 ** 6 - 6 ** 14 - 24

#перевод в 6-ую сс
s6 = ''
while s > 0:
	s6 = str(s % 6) + s6
	s = s // 6

print(len(set(s6)))
```
**Ответ:** 4.