## Решения различных типов задания 15

#### Тип 1. Побитовая конъюнкция
<blockquote>
Для какого наименешего неотрицательного целого числа <b>А</b> формула<br><br>
x & 25 ≠ 0 → (x & 17 = 0 → x & А ≠ 0)<br><br>
тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной <b>х</b>)?
</blockquote>

```python
for a in range(1000):
	flag = True
	for x in range(1000):
		if (x & 25 != 0) <= ((x & 17 == 0) <= (x & a != 0)):
			pass
		else:
			flag = False
	if flag:
		print(a)
		break
```

<details>
<summary><i>Задания Решу ЕГЭ этого типа:</i></summary>
<blockquote>9804, 34506, 34508, 34509, 34510, 34511, 34512, 34513, 34514, 34515, 34516, 34517, 34518, 34519, 34520, 34521, 34522, 35989, 36870, 38949, 39244</blockquote>
</details>

#### Примечание с Решу ЕГЭ
> Следует различать задания «найдите длину отрезка» и «найдите количество целых чисел на отрезке».
> 
> Длина отрезка равна расстоянию между его граничными точками. Длину отрезка можно вычислить по формуле *m−n*, где *m* и *n* — правая и левая границы этого отрезка соответственно. Длина отрезка не зависит от того, включены ли в него его границы. Заметим, однако, что если границы не включены, то должно использоваться слово «интервал», а не слово «отрезок».
> 
> Количество целых чисел на отрезке можно найти по формуле *m − n + 1*, где *m* и *n* — правая и левая границы этого отрезка соответственно, причем они входят в отрезок.
