#### Условие:

> Сергей составляет 5-буквенные коды из букв В, О, Р, О, Б, Е, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой Е. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Сергей?

#### Решение #1 (Python):
```python
from itertools import product
chars = 'ВРОБЕЙ'  # убрал одну "О", т.к. буквы в алфавите не должны повторяться
count = 0

for word in product(chars, repeat=5):
    if word.count('Й') == 1:
        if word[0] != 'Й' and word[-1] != 'Й':
            if word.count('Е'):
                if word[word.index('Й')+1] != 'Е' and word[word.index('Й')-1] != 'Е':
                    count += 1
            else:
                count += 1
    elif word.count('Й') == 0:
        count += 1

print(count)
```

**Ответ:** 4325
