#### Условие:

> Лиля составляет 5-буквенные слова из букв С, О, Т, К, А, П, Л, З. Слово не должно заканчиваться на гласную и содержать сочетания ЗЛО. Буквы в слове не повторяются. Сколько слов может составить Лиля?

#### Решение #1 (Python):
```python
from itertools import product
chars = 'СОТКАПЛЗ'
count = 0
vowels = ['А', 'О']

for word in product(chars, repeat=5):
    word = ''.join(word)
    if len(word) == len(set(word)) and word[-1] not in vowels and 'ЗЛО' not in word:
        count += 1

print(count)
```

**Ответ:** 5008
