#### Условие:

> Оля составляет 5-буквенные слова из букв К, У, С, А, Т, Ь, причём слова не должны начинаться на мягкий знак и содержать сочетание СУК. Буквы в слове не должны повторяться. Сколько различных слов может составить Оля?

#### Решение #1 (Python):
```python
from itertools import product
chars = 'КУСАТЬ'
words = set()

for word in product(chars, repeat=5):
    word = ''.join(word)
    if word[0] != 'Ь' and 'СУК' not in word and all(word.count(i) == 1 for i in word):
        words.add(word)

print(len(words))

```

#### Ответ: 586
