#### Условие:

> МАРИНА из букв своего имени составляет слова перестановкой исходных букв. Сколько различных слов может составить МАРИНА, если первая буква не может быть гласной? 

#### Решение #1 (Python):
```python
from itertools import product
chars = 'МАРИНА'
vowels = ['А', 'И']
words = set()

for word in product(chars, repeat=6):
    if word[0] not in vowels \
       and word.count('М') == word.count('Р') == word.count('Н') == word.count('И') == 1 \
       and word.count('А') == 2:
        words.add(''.join(word))

print(len(words))
```

#### Ответ: 180
