Текстовый файл состоит из символов P, Q, R и S. 

Определите максимальное количество идущих подряд символов

в прилагаемом файле, среди которых нет идущих подряд символов P. 
Для выполнения этого задания следует написать программу.

#### Решение #1 (Python)
```python
# Читает файл и создаёт список, каждым элементом которого является один символ из файла
f = list( open('24.txt').readline() )

s = ''
maxlen = 0

for i in f:
	s += i
	
	if s[-2:] == 'PP':
		if len(s) - 1 > maxlen:
			maxlen = len(s) - 1
		s = 'P'

print(maxlen)
```
**Ответ:** 188.
