Пусть M – сумма минимального и максимального натуральных делителей
 целого числа, не считая единицы и самого числа. Если таких делителей
 у числа нет, то значение M считается равным нулю. 

Напишите программу, которая перебирает целые числа, бо́льшие 700 000, 
в порядке возрастания и ищет среди них такие, для которых значение M
оканчивается на 8. Выведите первые пять найденных чисел
и соответствующие им значения M. 

Формат вывода: для каждого из пяти таких найденных чисел в отдельной
строке сначала выводится само число, затем – значение М. 
Строки выводятся в порядке возрастания найденных чисел. 

Количество строк в таблице для ответа избыточно.

#### Решение #1 (Python)
```python
count = 0
n = 700000

while count < 5:
	n += 1
	
	dels = []
	for j in range(2, n // 2 + 1):
		if n % j == 0:
			dels.append(j)
	
	if len(dels) > 0:
		M = dels[0] + dels[-1]
	else:
		M = 0
	
	if M % 10 == 8:
		print(n, M)
		count += 1
```

**Ответ:** 700005 233338, 700007 100008, 700012 350008, 700015 140008, 700031 24168.
