#### Условие:

> В файле 17-199.txt содержится последовательность целых чисел, которые принимают значения от -10000 до 10000 включительно. 
> Тройка идущих подряд чисел последовательности называется уникальной, если только второе из них является положительным трёхзначным > нечётным числом.
> 
> Определите количество уникальных троек чисел, а затем – максимальную из всех сумм таких троек. 

#### Решение #1 (Python):
```python
nums = [int(i) for i in open('17-5.txt').readlines()]
count = 0
maxSum = 0

for i in range(len(nums)-2):
    a = nums[i]
    b = nums[i+1]
    c = nums[i+2]
    if (b > 0 and b % 2 != 0 and len(str(b)) == 3) and not (a > 0 and a % 2 != 0 and len(str(a)) == 3) and not (c > 0 and c % 2 != 0 and len(str(c)) == 3):
        count += 1
        maxSum = max(maxSum, a+b+c)
print(count, maxSum)
```

#### Ответ: `94` `18841`
