#### Условие:

> Исполнитель Нолик преобразует двоичное число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> 
> 1. Прибавить 1
> 2. Добавить слева 1
> 
> Первая команда увеличивает число на 1. Вторая команда приписывает к двоичному числу слева 1, например, для числа 10 результатом работы данной команды будет являться число 110.
> 
> Сколько существует программ, которые исходное двоичное число 1 преобразуют в двоичное число 11111? 

#### Решение #1 (Python):
```python
def k(x, y):
    if int(x, 2) > int(y, 2):
        return 0
    elif int(x, 2) == int(y, 2):
        return 1
    else:
        return k(bin(int(x, 2)+1)[2:], y) + k('1' + x, y)

print(k('1', '11111'))
```

#### Ответ: `82`
