#### Условие:
> Имеется набор данных, состоящий из положительных целых чисел. Необходимо определить количество пар элементов (ai, aj) этого набора, в которых 1 ≤ i+5 ≤ j ≤ N и сумма элементов кратна 14.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10 000

#### Решение файла A (Python)
```python
f = open('files/2675_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        if j-i >= 5 and (a[i]+a[j]) % 14 == 0:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/2675_B.txt')
n = int(f.readline())
k = [0]*14
q = [int(f.readline()) for i in range(4)]
count = 0

for i in range(n-4):
    x = int(f.readline())
    ost = 0 if x % 14 == 0 else 14 - x % 14
    count += k[ost]

    k[q[0]%14] += 1
    q.pop(0)
    q.append(x)

print(count)
```

**Ответ:** 8 128567918
