#### Условие:
> Имеется набор данных, состоящий из целых чисел. Необходимо определить максимальное произведение подпоследовательности, состоящей из одного или более идущих подряд элементов.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит одно натуральное число, не превышающее по модулю 100

#### Решение файла A (Python)
```python
f = open('files/2679_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
mp = float('-inf')

for i in range(n):
    p = 1
    for j in range(i, n):
        p *= a[j]
        mp = max(mp, p)
print(mp)
```

#### Решение файла B (C++)
```cpp
#include<iostream>
#include<fstream>
#include<vector>
#include<ctime>
#include<math.h>
using namespace std;

int main() {
	int n;
	ifstream f("2679_B.txt");
	f >> n;
	vector<int> a(n);
	for (int i=0; i<n; i++) {
		f >> a[i];	
	}
	long long mp = -10^20;
	long long p = 1;
	
	for (int i=0; i<n; i++) {
		p = 1;
		for (int j=i; j<n; j++) {
			p *= a[j];
			mp = max(mp, p);
		}
		if (i % 50000 == 0) cout << i << ' ' << clock()/60000. * n/i << endl;
	}
	
	cout << "max summ: " << mp << endl;
	return 0;
}
```

**Ответ:** 663497670 999806976
