#### Условие:
> Дана последовательность N целых неотрицательных чисел. Необходимо определить количество пар положительных элементов этой последовательности, сумма которых четна, при этом между элементами пары есть хотя бы один ноль.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке натуральное число N (1 < N < 10000) – количество чисел в последовательности. В следующих N строках записаны числа, входящие в последовательность, по одному в каждой строке.
> 
> **Выходные данные:** Программа должна вывести одно число – количество найденных пар

#### Решение файла A (Python)
```python
f = open('files/2710_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    for j in range(i+1, n):
        buf = a[i+1:j]
        if (a[i]+a[j]) % 2 == 0 and 0 in buf and a[i] != 0 and a[j] != 0:
            count += 1
print(count)
```

**Ответ:** 51
