#### Условие:
> В файле записана последовательность натуральных чисел. Гарантируется, что все числа различны. Из этой последовательности нужно выбрать три числа, чтобы их сумма делилась на 3 и была наибольшей. Какую наибольшую сумму можно при этом получить?
> 
> Входные данные. Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 100000)

#### Решение файла A (Python)
```python
f = open('files/3771_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = 0

for i in range(n):
    s = 0
    for j in range(i+1, n):
        for k in range(j+1, n):
            if (a[i]+a[j]+a[k]) % 3 == 0:
                ms = max(ms, a[i]+a[j]+a[k])
print(ms)
```

**Ответ:** 2919
