#### Условие:
> Набор данных представляет собой последовательность натуральных чисел. Необходимо найти количество подпоследовательностей подряд идущих чисел, чтобы их сумма делилась на 39 и количество чисел в ней не превышало k=20. Гарантируется, что такие подпоследовательности существуют.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 108). Каждая из следующих N строк содержит натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/4280_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
count = 0

for i in range(n):
    s, k = 0, 0
    for j in range(i, n):
        s += a[j]
        k += 1
        if s % 39 == 0 and k <= 20:
            count += 1
print(count)
```

#### Решение файла B (C++)
```cpp
#include<iostream>
#include<fstream>
#include<vector>
#include<ctime>
using namespace std;

int main() {
	int n;
	ifstream f("4280_B.txt");
	f >> n;
	vector<int> a(n);
	for (int i=0; i<n; i++) f >> a[i];
	long long count = 0;
	long long s = 0;
	int k = 0;

	for (int i=0; i<n; i++) {
		s = 0;
		k = 0;
		for (int j=i; j<n; j++) {
			s += a[j];
			k += 1;
			if (s % 39 == 0 && k <= 20) {
				count++;
			}
		}
		if (i % 50000 == 0) cout << i << ' ' << clock()/60000. * (n-i)/i << endl;
	}
	cout << count << endl;
}
```

**Ответ:** 21 51023
