#### Условие:
> Дана последовательность натуральных чисел. Известно, что сумма всех чисел последовательности не превышает 109. Рассматриваются все её непрерывные подпоследовательности, в которых количество чисел, делящихся на 5, кратно K = 3. Найдите наибольшую сумму наибольшей такой подпоследовательности.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 100000). Каждая из следующих N строк файлов содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/4513_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = 0

for i in range(n):
    s, k = 0, 0
    for j in range(i, n):
        s += a[j]
        k += (a[j] % 5 == 0)
        if k % 3 == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4513_B.txt')
n = int(f.readline())
m = [10**30]*3
ms, s, k = 0, 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    k += (x % 5 == 0)
    if k % 3 == 0:
        ms = max(ms, s)
    s1 = s - m[k%3]
    ms = max(ms, s1)
    m[k%3] = min(m[k%3], s)
print(ms)
```

**Ответ:** 66453 69995639
