#### Условие:
> Дана последовательность натуральных чисел. Рассматриваются все её непрерывные подпоследовательности, в которых количество простых чисел кратно K = 9. Найдите наибольшую сумму такой подпоследовательности.
> 
> Входные данные. Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 100000). Каждая из следующих N строк файлов содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/4515_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = 0
p = lambda x: all(x % d for d in range(2, int(x**0.5)+1))

for i in range(n):
    s, k = 0, 0
    for j in range(i, n):
        s += a[j]
        k += p(a[j])
        if k % 9 == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4515_B.txt')
n = int(f.readline())
m = [float('inf')]*9
ms, s, k, = 0, 0, 0
p = lambda x: all(x % d for d in range(2, int(x**0.5)+1))

for i in range(n):
    x = int(f.readline())
    s += x
    k += p(x)
    if k % 9 == 0:
        ms = max(ms, s)
    s1 = s - m[k%9]
    ms = max(ms, s1)
    m[k%9] = min(m[k%9], s)

print(ms)
```

**Ответ:** 67645 69976583
