#### Условие:
> На вход программе подается последовательность чисел и значение K. Рассматриваются все непрерывные подпоследовательности исходной последовательности, в которых количество отрицательных чисел, десятичная запись которых заканчивается на 7, кратно K. Программа должна вывести одно число – максимальную сумму такой последовательности.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 5000000) и значение K. Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4738_A.txt')
n, k = map(int, f.readline().split())
a = [int(i) for i in f]
ms = float('-inf')

for i in range(n):
    s, c = 0, 0
    for j in range(i, n):
        s += a[j]
        c += (a[j] < 0 and abs(a[j]) % 10 == 7)
        if c % k == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4738_B.txt')
n, k = map(int, f.readline().split())
m = [10**30]*k
ms, s, c = float('-inf'), 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    c += (x < 0 and abs(x) % 10 == 7)
    if c % k == 0:
        ms = max(ms, s)
    s1 = s - m[c%k]
    ms = max(ms, s1)
    m[c%k] = min(m[c%k], s)
print(ms)
```

**Ответ:** 15218 253665
