#### Условие:
> На вход программе подается последовательность чисел и значение K. Особыми называются отрицательные числа, в пятеричной записи которых нет цифры 2. Рассматриваются все непрерывные подпоследовательности исходной последовательности, в которых количество особых чисел кратно K. Программа должна вывести одно число – максимальную сумму такой последовательности.
> 
> Входные данные. Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 5000000) и значение K. Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4739_A.txt')
n, k = map(int, f.readline().split())
a = [int(i) for i in f]
ms = float('-inf')


def t5(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%5) + s
        x //= 5
    return s


for i in range(n):
    s = 0
    c = 0
    for j in range(i, n):
        s += a[j]
        if a[j] < 0 and t5(a[j]).count('2') == 0:
            c += 1
        if c % k == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4739_B.txt')
n, k = map(int, f.readline().split())
m = [float('inf')]*k
ms, s, c, = 0, 0, 0


def t5(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%5) + s
        x //= 5
    return s


for i in range(n):
    x = int(f.readline())
    s += x
    if x < 0 and t5(x).count('2') == 0:
        c += 1
    if c % k == 0:
        ms = max(ms, s)
    s1 = s - m[c%k]
    ms = max(ms, s1)
    m[c%k] = min(m[c%k], s)
print(ms)
```

**Ответ:** 15406 256483
