#### Условие:
> На вход программе подается последовательность чисел, а также натуральные числа K и D. Особыми называются отрицательные числа, в пятеричной записи которых нет цифры 1. Рассматриваются все непрерывные подпоследовательности исходной последовательности, в которых количество особых чисел кратно K, а сумма всех элементов подпоследовательности кратна D. Программа должна вывести одно число – максимальную сумму такой последовательности.
> 
> Входные данные. Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 5000000), значение K (K > 0) и значение D (D > 0), разделённые пробелами. Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4842_A.txt')
n, k, d = map(int, f.readline().split())
a = [int(i) for i in f]
ms = float('-inf')


def t5(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%5) + s
        x //= 5
    return s


for i in range(n):
    s = 0
    c = 0
    for j in range(i, n):
        s += a[j]
        if a[j] < 0 and t5(a[j]).count('1') == 0:
            c += 1
        if c % k == 0 and s % d == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4842_B.txt')
n, k, d = map(int, f.readline().split())
m = [[10**30]*k for i in range(d)]
ms, s, c = float('-inf'), 0, 0


def t5(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%5) + s
        x //= 5
    return s


for i in range(n):
    x = int(f.readline())
    s += x
    if x < 0 and t5(x).count('1') == 0:
        c += 1
    if c % k == 0 and s % d == 0:
        ms = max(ms, s)
    s1 = s - m[s%d][c%k]
    ms = max(ms, s1)
    m[s%d][c%k] = min(m[s%d][c%k], s)

print(ms)
```

**Ответ:** 7376668 166798285
