#### Условие:
> На вход программе подается последовательность чисел, а также натуральные числа K и D. Особыми называются отрицательные числа, для которых сумма цифр троичной записи равна 12. Рассматриваются все непрерывные подпоследовательности исходной последовательности, в которых количество особых чисел кратно K, а количество всех элементов подпоследовательности кратно D. Программа должна вывести одно число – максимальную сумму такой последовательности.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (2 ≤ N ≤ 5000000), значение K (K > 0) и значение D (D > 0), разделённые пробелами. Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4843_A.txt')
n, k, d = map(int, f.readline().split())
a = [int(i) for i in f]
ms = float('-inf')

def s3(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%3) + s
        x //= 3
    return sum(int(i) for i in s)

for i in range(n):
    s, c, p = 0, 0, 0
    for j in range(i, n):
        s += a[j]
        p += 1
        if a[j] < 0 and s3(a[j]) == 12:
            c += 1
        if c % k == 0 and p % d == 0:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4843_B.txt')
n, k, d = map(int, f.readline().split())
m = [[10**30]*k for i in range(d)]
ms = float('-inf')
s, c, p = 0, 0, 0


def s3(x):
    x = abs(x)
    s = ''
    while x > 0:
        s = str(x%3) + s
        x //= 3
    return sum(int(i) for i in s)


for i in range(n):
    x = int(f.readline())
    s += x
    p += 1
    if x < 0 and s3(x) == 12:
        c += 1
    if c % k == 0 and p % d == 0:
        ms = max(ms, s)
    s1 = s - m[p%d][c%k]
    ms = max(ms, s1)
    m[p%d][c%k] = min(m[p%d][c%k], s)

print(ms)
```

**Ответ:** 6597803 168674858
