#### Условие:
> На вход программе подается последовательность целых чисел. Особым называется положительное четное число. Рассматриваются все непрерывные подпоследовательности исходной последовательности, содержащих ровно одно особое число. Программа должна вывести одно число – максимальную сумму такой подпоследовательности. Гарантируется, что в последовательность существует хотя бы одно особое число.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (100 ≤ N ≤ 5000000). Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4847_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = float('-inf')

for i in range(n):
    s = 0
    k = 0
    for j in range(i, n):
        s += a[j]
        if a[j] > 0 and a[j] % 2 == 0:
            k += 1
        if k == 1:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4847_B.txt')
n = int(f.readline())
m = [10**30]*n
ms = float('-inf')
s, k = 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if x > 0 and x % 2 == 0:
        k += 1
    if k == 1:
        ms = max(ms, s)
    s1 = s - m[k-1]
    ms = max(ms, s1)
    m[k] = min(m[k], s)
print(ms)
```

**Ответ:** 4710 7368
