#### Условие:
> На вход программе подается последовательность целых чисел и натуральное число K. Особым числом называется отрицательное число, заканчивающееся на 3. Рассматриваются все непрерывные подпоследовательности исходной последовательности, содержащие ровно K особых чисел. Программа должна вывести одно число – максимальную сумму элементов такой подпоследовательности. Гарантируется, что в последовательности существует хотя бы K особых чисел.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (100 ≤ N ≤ 5000000) и натуральное число K. Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4848_A.txt')
n, k = map(int, f.readline().split())
a = [int(i) for i in f]
ms = float('-inf')

for i in range(n):
    s = 0
    c = 0
    for j in range(i, n):
        s += a[j]
        if a[j] < 0 and abs(a[j]) % 10 == 3:
            c += 1
        if c == k:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (Python)
```python
f = open('files/4848_B.txt')
n, k = map(int, f.readline().split())
m = [10**30]*n
ms, s, c = float('-inf'), 0, 0

for i in range(n):
    x = int(f.readline())
    s += x
    if x < 0 and abs(x) % 10 == 3:
        c += 1
    if c == k:
        ms = max(ms, s)
    s1 = s - m[c-k]
    ms = max(ms, s1)
    m[c] = min(m[c], s)

print(ms)
```

**Ответ:** 20139 38739
