#### Условие:
> На вход программе подается последовательность целых чисел. Рассматриваются все непрерывные подпоследовательности исходной последовательности, содержащие одинаковое количество чисел, кратных 5, и чисел, кратных 7. Программа должна вывести одно число – максимальную сумму элементов такой подпоследовательности. Гарантируется, что в последовательности такая подпоследовательность есть.
> 
> **Входные данные.** Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (100 ≤ N ≤ 5000000). Каждая из следующих N строк файлов содержит одно целое число, не превышающее по модулю 10000

#### Решение файла A (Python)
```python
f = open('files/4904_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
ms = float('-inf')

for i in range(n):
    s = 0
    k5 = k7 = 0
    for j in range(i, n):
        s += a[j]
        k5 += (a[j] % 5 == 0)
        k7 += (a[j] % 7 == 0)
        if k5 == k7:
            ms = max(ms, s)
print(ms)
```

#### Решение файла B (C++)
```cpp
#include<iostream>
#include<fstream>
#include<vector>
#include<math.h>
#include<ctime>
using namespace std;

int main() {
	int n;
	ifstream f("4904_B.txt");
	f >> n;
	vector<int> a(n);
	for (int i=0;i<n;i++) f >> a[i];
	long long ms = -10^30;
	long long s = 0;
	long long k5 = 0;
	long long k7 = 0;
	for (int i=0;i<n;i++) {
		s = 0;
		k5 = 0;
		k7 = 0;
		for (int j=i;j<n;j++) {
			s += a[j];
			if (a[j]%5==0) k5++;
			if (a[j]%7==0) k7++;
			if (k5==k7) ms = max(ms, s);
		}
		if (i%50000==0) cout << i << ' ' << clock()/60000. * (n-i)/i << endl;
	}
	
	cout << ms << endl;
}
```

**Ответ:** 497239 4282001
