#### Условие:
> На вход программе подается последовательность целых чисел и натуральное число M. Рассматриваются все непрерывные подпоследовательности исходной последовательности, такие что произведение элементов каждой из них не кратно M. Найдите количество таких подпоследовательностей.
> 
> Входные данные. Даны два входных файла (файл A и файл B), содержит в первой строке числа N и M, записанные через пробел (1 ≤ N, M ≤ 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/5132_A.txt')
n, m = map(int, f.readline().split())
a = [int(i) for i in f]
count = 0

for i in range(n):
    p = 1
    for j in range(i, n):
        p *= a[j]
        if p % m:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/5132_B.txt')
n, m = map(int, f.readline().split())
a = [int(i) for i in f]
count, i2, p = 0, 0, 1

for i in range(n):
    x = a[i]
    p *= x
    while p % m == 0:
        p //= a[i2]
        i2 += 1
    count += i - i2 + 1
print(count)
```

**Ответ:** 391 2534979
