#### Условие:
> На вход программе подается последовательность целых чисел. Рассматриваются все непрерывные подпоследовательности исходной последовательности, такие что произведение элементов каждой из них не кратно M = 858967. Найдите количество таких подпоследовательностей.
> 
> Входные данные. Даны два входных файла (файл A и файл B), содержит в первой строке число N (1 ≤ N ≤ 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/5133_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 858967
count = 0
for i in range(n):
    s = 1
    for j in range(i, n):
        s *= a[j]
        if s % m:
            count += 1
print(count)
```

#### Решение файла B [1 способ] (Python)
```python
f = open('files/5133_B.txt')
n = int(f.readline())
m = 858967
count = 0

# Раскладываем M на простые множители
p = lambda x: all(x % d for d in range(2, int(x**0.5)+1))
divs = {i for i in range(2, m) if m % i == 0 and p(i)}
k = {}
for i in divs:
    k[i] = 0

# Перебираем числа из файла и сохраняем индексы множителей M в k
for i in range(n):
    x = int(f.readline())
    for d in k:
        if x % d == 0:
            k[d] = i + 1
    mi = float('inf')
    for d in k:
        mi = min(mi, k[d])
    count += i - mi + 1

print(count)
```

#### Решение файла B [2 способ] (Python)
```python
f = open('files/5133_B.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 858967
count, i2, p = 0, 0, 1

for i in range(n):
    x = a[i]
    p *= x
    while p % m == 0:
        p //= a[i2]
        i2 += 1
    count += i - i2 + 1

print(count)
```

**Ответ:** 101025 38235097
