#### Условие:
> На вход программе подается последовательность целых чисел. Рассматриваются все непрерывные подпоследовательности исходной последовательности, такие что произведение элементов каждой из них не кратно M = 524288. Найдите количество таких подпоследовательностей.
> 
> Входные данные. Даны два входных файла (файл A и файл B), содержит в первой строке число N (1 ≤ N ≤ 10 000 000). Каждая из следующих N строк содержит одно натуральное число, не превышающее 10000

#### Решение файла A (Python)
```python
f = open('files/5134_A.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 524288
count = 0

for i in range(n):
    s = 1
    for j in range(i, n):
        s *= a[j]
        if s % m:
            count += 1
print(count)
```

#### Решение файла B (Python)
```python
f = open('files/5134_B.txt')
n = int(f.readline())
a = [int(i) for i in f]
m = 524288
count, i2, p = 0, 0, 1

for i in range(n):
    x = a[i]
    p *= x
    while p % m == 0:
        p //= a[i2]
        i2 += 1
    count += i - i2 + 1
print(count)
```

**Ответ:** 18871 3921243
