#### Условие:

> Алгоритм вычисления значения функции F(n), где n – целое число, задан следующими соотношениями:
> 
> F(n) = 1, при n < 2,
> F(n) = F(n/3) + 1, когда n ≥ 2 и делится на 3,
> F(n) = F(n - 2) + 5, когда n ≥ 2 и не делится на 3.
> 
> Назовите минимальное значение n, для которого F(n) равно 73. 

#### Решение #1 (Python):
```python
def f(n):
    if n < 2:
        return 1
    elif n >= 2 and n % 3 == 0:
        return f(n/3) + 1
    elif n >= 2 and n % 3 != 0:
        return f(n-2) + 5

arr = []
for i in range(3, 100000):
    if f(i) == 73:
        arr.append(i)
print(min(arr))
```

#### Ответ: `5101`
