#### Условие:
> Известно, что исходная строка начиналась с нуля и заканчивалась нулём, а между ними были только цифры 1, 2 и 3. После выполнения данной программы получилась строка, содержащая 96 единиц, 36 двоек и 80 троек. Сколько цифр было в исходной строке?

#### Решение (Python)
```python
for x in range(1, 60):
    for y in range(1, 60):
        for z in range(1, 60):
            s = '0' + '1'*x + '2'*y + '3'*z + '0'
            s1 = s
            while '00' not in s:
                s = s.replace('01', '21022', 1)
                s = s.replace('02', '310', 1)
                s = s.replace('03', '230112', 1)
            if s.count('1') == 96 and s.count('2') == 36 and s.count('3') == 80:
                print(len(s1))
```

**Ответ:** 26
