#### Условие:

> В какой системе счисления выполняется равенство 12<sub>X</sub> · 33<sub>X</sub> = 406<sub>X</sub>? В ответе укажите число – основание системы счисления.

#### Решение #1 (Python):
```python
n1 = '12'
n2 = '33'
n3 = '406'
base = 0

for i in range(7, 16):
    if int(n1, base=i) * int(n2, base=i) == int(n3, base=i):
        base = i

print(base)
```

#### Ответ: 9
