#### Условие:
> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [333555; 777999], числа, среди делителей которых есть ровно 35 двузначных чисел. Для каждого найденного числа запишите наименьший и наибольший из них.

#### Решение #1 (Python)
```python
def find_divs(n):
    a = set()
    for d in range(1, int(n**0.5)+1):
        if n % d == 0:
            a.add(d)
            a.add(n // d)
    return a


for i in range(333555, 777999+1):
    n = find_divs(i)
    a = []
    cnt = 0
    for j in n:
        if len(str(j)) == 2:
            cnt += 1
            a.append(j)
    if cnt == 35:
        print(a[0], a[-1])
```

**Ответ:** 
```
10 96
10 99
10 99
10 91
10 99
```
