#### Условие:
> Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [100000; 500000] числа, имеющие больше 150 чётных делителей, не считая самого числа и единицы. Для каждого найденного числа запишите само число и разницу наибольшего и наименьшего делителя в таблицу.

#### Решение #1 (Python)
```python
def find_divs(n):
    a = set()
    for d in range(2, int(n**0.5)+1):
        if n % d == 0:
            a.add(d)
            a.add(n // d)
    return sorted(a)


for i in range(100000, 500000+1):
    n = find_divs(i)
    cnt = 0
    for j in n:
        if j % 2 == 0:
            cnt += 1
    if cnt > 150:
        print(i, n[-1] - n[0])
```

**Ответ:**
```
332640 166318
393120 196558
443520 221758
480480 240238
498960 249478
```
