#### Условие:
> Сколько различных результатов можно получить из исходного числа 1 после выполнения программы, содержащей ровно 9 команд?

#### Решение (Python)
```python
a = set()

def f(x, c):
    if c == 9:
        return a.add(x)
    f(x*2, c+1)
    f(x*2+1, c+1)

f(1, 0)
print(len(a))
```

**Ответ:** 512
