#### Уловие:
> Исполнитель К22 преобразует число, записанное на экране.
> 
> У исполнителя есть три команды, которым присвоены номера:
> 
> Прибавить 1
> 
> Прибавить 3
> 
> Прибавить 5
> 
> Первая из них увеличивает число на экране на 1, вторая увеличивает его на 3, третья увеличивает его на 5.
> 
> Программа для исполнителя К22 –  это последовательность команд.
> 
> Сколько существует таких программ, которые преобразуют исходное число 3 в число 25 и при этом траектория вычислений программы содержит ровно 6 четных чисел?

#### Решение:
```python
def f(x, y, c):
    if x > y:
        return 0
    if x == y and c == 6:
        return 1
    if x % 2 == 0:
        return f(x+1, y, c) + f(x+3, y, c) + f(x+5, y, c)
    if x % 2:
        return f(x+1, y, c+1) + f(x+3, y, c+1) + f(x+5, y, c+1)


print(f(3, 25, 0))
```

**Ответ:** 3432
