#### Условие:
> Сколько существует программ, которые преобразуют исходное число 10 в число 220, если известно, что любая из команд увеличивает число?

#### Решение (Python)
```python
from functools import lru_cache

@lru_cache(None)
def f(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    if str(x)[-1] not in '01':
        return f(x+5, y) + f(x+10, y) + f(x*(int(str(x)[-1])), y)
    else:
        return f(x+5, y) + f(x+10, y)

print(f(10, 220))
```

**Ответ:** 434347212
