#### Условие:
> Исполнитель U18 преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> 
> 1. Вычесть 1
> 
> 2. Вычесть 3
> 
> 3. Разделить нацело на 3
> 
> При выполнении команды 3 выполняется деление нацело (остаток отбрасывается). Программа для исполнителя U18 – это последовательность команд. Сколько существует таких программ, которые исходное число 22 преобразуют в число 2?

#### Решение (Python)
```python
def k(x, y):
    if x < y:
        return 0
    if x == y:
        return 1
    else:
        return k(x-1, y) + k(x-3, y) + k(x//3, y)


print(k(22, 2))
```

**Ответ:** 2196
