#### Условие:
>  Сколько существует таких программ, которые исходное число 1 преобразуют в число 52 и при этом траектория вычислений программы содержит число 16?

#### Решение:
```python
def f(x, y):
    if x > y:
        return 0
    if x == y:
        return 1
    return f(x+2, y) + f(x*2, y)


print(f(1, 16) * f(16, 52))
```

**Ответ:** 105
